&НаКлиенте
Перем ДатаСистемы;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДатаСистемы = ТекущаяДата();
	ОтобразитьКнопкуУдаленияПомеченных();
	СформироватьРабочийСтол(ДатаСистемы);
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьКнопкуУдаленияПомеченных()

	 Если Обработки.УдалениеПомеченныхУроков.ПолучитьПомеченныеОбъектыНаСервере().Количество() > 0 Тогда
	
		 Элементы.ФормаУдалитьПомеченныеУроки.Видимость = Истина;
	
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура СформироватьРабочийСтол(Дата)

	 // вывод уведомлений
	СписокУведомлений = РаботаСУведомлениями.СформироватьСписокУведомленийОЗаметках(Дата);
	
	Для каждого уведомление Из СписокУведомлений Цикл
		
		Если уведомление.Важность = "Критично" Тогда
		
			 ПоказатьОповещениеПользователя(уведомление.Текст,
									уведомление.Ссылка, 
									"Перейти",
									БиблиотекаКартинок.ОформлениеКругКрасный, СтатусОповещенияПользователя.Важное);
		
		Иначе
		
			ПоказатьОповещениеПользователя(уведомление.Текст,
									уведомление.Ссылка, 
									"Перейти",
									БиблиотекаКартинок.ОформлениеКругЖелтый, СтатусОповещенияПользователя.Важное);
		
		КонецЕсли;
		
	
	КонецЦикла;
	
	СписокУведомлений = РаботаСУведомлениями.СформироватьСписокУведомленийОГруппах(Дата);
	
	Для каждого уведомление Из СписокУведомлений Цикл
	
		ПоказатьОповещениеПользователя(уведомление.Текст,
									, 
									,
									БиблиотекаКартинок.ОформлениеВосклицательныйЗнак, СтатусОповещенияПользователя.Важное);
	
	КонецЦикла;
	// вывод виджетов
	ВыполнитьОбновлениеСпискаЗадач();


КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМаксимальныйНомерПары(СписокЗадач)
	
	МаксНомерПары = 1;
	
	Для каждого Задача Из СписокЗадач Цикл
		
		Если Задача.НомерПары > МаксНомерПары Тогда
		
			МаксНомерПары = Задача.НомерПары;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МаксНомерПары;
	
КонецФункции // ПолучитьМаксимальныйНомерПары()


&НаКлиенте
Процедура ВывестиВиджетыНаРабочийСтол()

	Если Лев(ТекущаяДата(),10) = Лев(ДатаСистемы,10) Тогда
	
		ВызватьЗаголовок(ТекущаяДата());
		
	Иначе
		
		ВызватьЗаголовок(ДатаСистемы);
		
	КонецЕсли;
	
	СписокЗадач = РаботаСЗадачами.ПолучитьСписокЗадач(ДатаСистемы);
	
	Для НомерВСписке = 1 По ПолучитьМаксимальныйНомерПары(СписокЗадач) Цикл
	      ЗадачаНайдена = Ложь;
		  Для каждого Задача Из СписокЗадач Цикл

				 Если НомерВСписке <> Задача.НомерПары Тогда
				 
					  Продолжить;
				 
				 КонецЕсли;
				 Если Задача.ВторойПреподавательП <> "" Тогда
				 
				 	  ВызватьОбластьПервую(Задача, Задача.НомерПары);
				 
				 КонецЕсли;
			     Если Задача.ВторойПреподавательП = "" И (Задача.Замена ИЛИ Задача.Совмещение) Тогда
					 
					 Если Задача.Замена <> Задача.Совмещение Тогда
					  
					  	    ВызватьОбластьВторую(Задача, Задача.НомерПары);
					  
					  КонецЕсли;
				 	  
				 
				  КонецЕсли;
				  Если Задача.ВторойПреподавательП = "" И Не Задача.Замена И Не Задача.Совмещение Тогда
				 
				 	  ВызватьОбластьТретью(Задача, Задача.НомерПары);
				 
				  КонецЕсли;
				  
				  Если Задача.ВторойПреподавательП = "" И (Задача.Замена И Задача.Совмещение) Тогда
				 
				 	  ВызватьОбластьЧетвертую(Задача, Задача.НомерПары);
				 
				  КонецЕсли;
				  
				  ЗадачаНайдена = Истина;
		КонецЦикла;
		Если Не ЗадачаНайдена Тогда
		
			ВызватьОбластьПустую(НомерВСписке);
		
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ВызватьЗаголовок(ДатаСистемы)
	
	РабочийСтол.Очистить();
	МакетВиджета = Обработки.СписокЗадач.ПолучитьМакет("МакетВиджетов2");
	ТекДок = РабочийСтол;
	Область = МакетВиджета.ПолучитьОбласть("Дата"); 
	Область.Параметры.Дата = ДатаСистемы;
	ТекДок.Вывести(Область);

КонецПроцедуры


&НаСервере
Процедура ВызватьОбластьПустую(НомерВСписке)

	МакетВиджета = Обработки.СписокЗадач.ПолучитьМакет("МакетВиджетов2");
	
	ТекДок = РабочийСтол;
	
		Область = МакетВиджета.ПолучитьОбласть("ОбластьОкно");

	
	Если НомерВСписке = 1 ИЛИ НомерВСписке = 3 ИЛИ НомерВСписке = 5 Тогда
	
		ТекДок.Вывести(Область);
		
	Иначе
		
		ТекДок.Присоединить(Область);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ВызватьОбластьПервую(Задача, НомерВСписке)

	МакетВиджета = Обработки.СписокЗадач.ПолучитьМакет("МакетВиджетов2");
	
	ТекДок = РабочийСтол;
	
	Если Не Задача.ЗанятиеПроведено Тогда
	
		Область = МакетВиджета.ПолучитьОбласть("ОбластьПервая");
	    Область.Параметры.Ссылка = Задача;
		
	Иначе
	
		Область = МакетВиджета.ПолучитьОбласть("ОбластьПерваяПройдена");
	    Область.Параметры.Ссылка = Задача;
		
	КонецЕсли;
	
	
	Область.Параметры.Группа = Задача.ГруппаП;
	Область.Параметры.Предмет = Задача.ПредметП;
	Область.Параметры.Время = Задача.Время; 
	
	Если Задача.Замена Тогда
	
		Область.Параметры.ЗаменаСовмещение = ?(Задача.Замена, " Замена ","");	
	
	Иначе Если Задача.Совмещение Тогда
	
		Область.Параметры.ЗаменаСовмещение = ?(Задача.Совмещение, " Совмещение ","");
		
	КонецЕсли;
	КонецЕсли;

	Область.Параметры.Преподаватель = Задача.ВторойПреподавательП;
	
	Если НомерВСписке = 1 ИЛИ НомерВСписке = 3 ИЛИ НомерВСписке = 5 Тогда
	
		ТекДок.Вывести(Область);
		
	Иначе
		
		ТекДок.Присоединить(Область);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ВызватьОбластьВторую(Задача, НомерВСписке)

	МакетВиджета = Обработки.СписокЗадач.ПолучитьМакет("МакетВиджетов2");
	
	ТекДок = РабочийСтол;
	
	Если Не Задача.ЗанятиеПроведено Тогда
	
		Область = МакетВиджета.ПолучитьОбласть("ОбластьВторая");
	    Область.Параметры.Ссылка = Задача;
		
	Иначе
	
		Область = МакетВиджета.ПолучитьОбласть("ОбластьВтораяПройдена");
	    Область.Параметры.Ссылка = Задача;
		
	КонецЕсли;
	
	
	Область.Параметры.Группа = Задача.ГруппаП;
	Область.Параметры.Предмет = Задача.ПредметП;
	Область.Параметры.Время = Задача.Время; 
	
	Если Задача.Замена Тогда
	
		Область.Параметры.ЗаменаСовмещение = ?(Задача.Замена, " Замена ","");	
	
	Иначе Если Задача.Совмещение Тогда
	
		Область.Параметры.ЗаменаСовмещение = ?(Задача.Совмещение, " Совмещение ","");
		
	КонецЕсли;
	КонецЕсли;
	
	Если НомерВСписке = 1 ИЛИ НомерВСписке = 3 ИЛИ НомерВСписке = 5 Тогда
	
		ТекДок.Вывести(Область);
		
	Иначе
		
		ТекДок.Присоединить(Область);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ВызватьОбластьТретью(Задача, НомерВСписке)

	МакетВиджета = Обработки.СписокЗадач.ПолучитьМакет("МакетВиджетов2");
	
	ТекДок = РабочийСтол;
	
	Если Не Задача.ЗанятиеПроведено Тогда
	
		Область = МакетВиджета.ПолучитьОбласть("ОбластьТретья");
	    Область.Параметры.Ссылка = Задача;
		
	Иначе
	
		Область = МакетВиджета.ПолучитьОбласть("ОбластьТретьяПройдена");
	    Область.Параметры.Ссылка = Задача;
		
	КонецЕсли;
	
	
	Область.Параметры.Группа = Задача.ГруппаП;
	Область.Параметры.Предмет = Задача.ПредметП;
	Область.Параметры.Время = Задача.Время; 
	
	Если НомерВСписке = 1 ИЛИ НомерВСписке = 3 ИЛИ НомерВСписке = 5 Тогда
	
		ТекДок.Вывести(Область);
		
	Иначе
		
		ТекДок.Присоединить(Область);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ВызватьОбластьЧетвертую(Задача, НомерВСписке)

	МакетВиджета = Обработки.СписокЗадач.ПолучитьМакет("МакетВиджетов2");
	
	ТекДок = РабочийСтол;
	
	Если Не Задача.ЗанятиеПроведено Тогда
	
		Область = МакетВиджета.ПолучитьОбласть("ОбластьЧетвертая");
	    Область.Параметры.Ссылка = Задача;
		
	Иначе
	
		Область = МакетВиджета.ПолучитьОбласть("ОбластьЧетвертаяПройдена");
	    Область.Параметры.Ссылка = Задача;
		
	КонецЕсли;
	
	
	Область.Параметры.Группа = Задача.ГруппаП;
	Область.Параметры.Предмет = Задача.ПредметП;
	Область.Параметры.Время = Задача.Время; 
	Область.Параметры.Замена = " Замена ";
	Область.Параметры.Совмещение = " Совмещение ";
	
	Если НомерВСписке = 1 ИЛИ НомерВСписке = 3 ИЛИ НомерВСписке = 5 Тогда
	
		ТекДок.Вывести(Область);
		
	Иначе
		
		ТекДок.Присоединить(Область);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаметку(Команда)
	ОткрытьФорму("Документ.СозданиеЗаметки.Форма.ФормаДокумента");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРасписание(Команда)
	ОткрытьФорму("Документ.ФормированиеДневногоРасписания.Форма.ФормаДокумента");
КонецПроцедуры

&НаКлиенте
Процедура ПровестиАттестацию(Команда)
	ОткрытьФорму("Документ.ПроведениеАттестации.Форма.ФормаДокумента");
КонецПроцедуры

&НаКлиенте
Процедура РабочийСтолОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	
	
	Если Не Расшифровка.ЗанятиеПроведено И Не ЗначениеЗаполнено(Расшифровка.Ссылка)  Тогда
	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Предмет",Расшифровка.Предмет);
		ПараметрыФормы.Вставить("Группа",Расшифровка.Группа);
		ПараметрыФормы.Вставить("ВторойПреподаватель",Расшифровка.ВторойПреподаватель);
		ПараметрыФормы.Вставить("НомерПары",Расшифровка.НомерПары);
		ПараметрыФормы.Вставить("Период",Расшифровка.Период);
		ОткрытьФорму("Документ.ПроведениеЗанятия.Форма.ФормаДокумента", ПараметрыФормы);
		
	Иначе Если Расшифровка.ЗанятиеПроведено ИЛИ Расшифровка.Ссылка <> "" Тогда
	
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Расшифровка.Ссылка));
	    
	КонецЕсли;
		
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура РабочийСтолОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗамен(Команда)
	ОткрытьФорму("Отчет.Замены.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СписокСовмещений(Команда)
	ОткрытьФорму("Отчет.Сдвоенные.Форма");
КонецПроцедуры

&НаКлиенте
Процедура Журнал(Команда)
	ОткрытьФорму("Обработка.Журнал.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура Статистика(Команда)
	ОткрытьФорму("Обработка.СтатистикаПоДисциплинамИГруппам.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка(Команда)
	ОткрытьФорму("РегистрСведений.НагрузкиПреподавателей.Форма.ФормаСписка");
КонецПроцедуры

&НаСервере
Процедура СменитьДатуНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СменитьДату(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьНовуюДату", ЭтотОбъект);
	ОткрытьФорму("Обработка.СменаДаты.Форма.Форма",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНовуюДату(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ДатаСистемы = Результат;
		СформироватьРабочийСтол(ДатаСистемы);
		 
	КонецЕсли;
		

КонецПроцедуры

&НаСервере
Функция ПолучитьВремяОбновленияРабочегоСтола()

	 Возврат Константы.ВремяОбновления.Получить();

КонецФункции // ПолучитьВремяОбновления()


 &НаКлиенте
Процедура ВыполнитьОбновлениеСпискаЗадач()
	
	ОтключитьОбработчикОжидания("ВывестиВиджетыНаРабочийСтол");
	ВывестиВиджетыНаРабочийСтол();
	ВремяОбновления = ПолучитьВремяОбновленияРабочегоСтола();
	Если ВремяОбновления = 0 Тогда
	
		ПодключитьОбработчикОжидания("ВывестиВиджетыНаРабочийСтол",60);
	
	Иначе
	
		ПодключитьОбработчикОжидания("ВывестиВиджетыНаРабочийСтол",60*ВремяОбновления);
	
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура УдалитьПомеченныеУроки(Команда)
	ОткрытьФорму("Обработка.УдалениеПомеченныхУроков.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаПреподавателя(Команда)
	ОткрытьФорму("Отчет.СтатистикаРаботыПреподавателя.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонсультацию(Команда)
	ОткрытьФорму("Документ.ДобавитьКонсультацию.Форма.ФормаДокумента");
КонецПроцедуры



