
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ВыполнениеНагрузки)
	ТабДок = Новый ТабличныйДокумент;
	ВыполнениеНагрузки(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ВыполнениеНагрузки(ТабДок, ПараметрКоманды)
	Документы.ФормированиеНагрузки.ВыполнениеНагрузки(ТабДок, ПараметрКоманды);
КонецПроцедуры
