// Возвращает подписанта из настроек организации для служебки в печатной форме посещений
//
// Возвращаемое значение:
//   Массив[3] - на имя кого служебка, название организации и физическое лицо
//
Функция ПолучитьПодписантаДляМакетаСлужебкиПосещения() Экспорт

	МассивПодписантаДляСлужебкиПосещаемости = Новый Массив;
	ПодписантОрганизации = Справочники.НастройкиОрганизации.Выбрать();
	
	КоличествоОрганизаций = 0;
	
	Пока ПодписантОрганизации.Следующий() Цикл
	
		ТаблицаПодписантов = ПодписантОрганизации.ПодписантыПоДокументам;
	    Орг = ПодписантОрганизации.СокращенноеНаименование;
		КоличествоОрганизаций = КоличествоОрганизаций + 1;
		
	КонецЦикла;
	
	Если КоличествоОрганизаций = 0 Тогда
		
		Сообщить("Не задана организация!");
		 Возврат МассивПодписантаДляСлужебкиПосещаемости;
	
	КонецЕсли;
	
	Для НПодписант = 0 По ТаблицаПодписантов.Количество()-1 Цикл
	
		  Если ТаблицаПодписантов[НПодписант].Текущий Тогда
			
			МассивПодписантаДляСлужебкиПосещаемости.Добавить(ТаблицаПодписантов[НПодписант].ОтображениеВДокументах);
			МассивПодписантаДляСлужебкиПосещаемости.Добавить(Орг);
			МассивПодписантаДляСлужебкиПосещаемости.Добавить(ОбщиеФункции.ПросклонятьФИОДляДокументов(ТаблицаПодписантов[НПодписант].ФИО, ТаблицаПодписантов[НПодписант].Пол)[0]);
			Прервать;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Если МассивПодписантаДляСлужебкиПосещаемости.Количество() = 0 Тогда
	
		Сообщить("Не задан подписант от организации!");
	
	КонецЕсли;
	
	Возврат МассивПодписантаДляСлужебкиПосещаемости;
	
КонецФункции // ПолучитьПодписантаДляМакетаСлужебкиПосещения()
