
Процедура ВыполнениеНагрузки(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ВыполнениеНагрузки)
	Макет = Документы.ФормированиеНагрузки.ПолучитьМакет("МойМакет");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФормированиеНагрузкиНагрузка1.НомерСтроки КАК НомерСтроки,
	|	ФормированиеНагрузкиНагрузка1.Предмет КАК Предмет,
	|	ФормированиеНагрузкиНагрузка1.Группа КАК Группа,
	|	ФормированиеНагрузкиНагрузка1.ВсегоЧасов КАК ВсегоЧасов,
	|	1 КАК Семестр
	|ПОМЕСТИТЬ Нагрузка
	|ИЗ
	|	Документ.ФормированиеНагрузки.Нагрузка1 КАК ФормированиеНагрузкиНагрузка1
	|ГДЕ
	|	ФормированиеНагрузкиНагрузка1.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФормированиеНагрузкиНагрузка2.НомерСтроки,
	|	ФормированиеНагрузкиНагрузка2.Предмет,
	|	ФормированиеНагрузкиНагрузка2.Группа,
	|	ФормированиеНагрузкиНагрузка2.ВсегоЧасов,
	|	2
	|ИЗ
	|	Документ.ФормированиеНагрузки.Нагрузка2 КАК ФормированиеНагрузкиНагрузка2
	|ГДЕ
	|	ФормированиеНагрузкиНагрузка2.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Нагрузка.НомерСтроки КАК Ном,
	|	Нагрузка.Предмет КАК Предмет,
	|	Нагрузка.Группа КАК Группа,
	|	Нагрузка.ВсегоЧасов КАК ВсегоЧасов,
	|	Нагрузка.ВсегоЧасов - ЕСТЬNULL(ОстатокУчетаЧасовОстатки.КоличествоОстаток, 0) КАК ОтработаноЧасов,
	|	Нагрузка.ВсегоЧасов - ЕСТЬNULL(ОстатокУчетаЧасовОстатки.КоличествоОстаток, 0) КАК Остаток,
	|	Нагрузка.Семестр КАК Семестр
	|ИЗ
	|	Нагрузка КАК Нагрузка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстатокУчетаЧасов.Остатки КАК ОстатокУчетаЧасовОстатки
	|		ПО Нагрузка.Семестр = ОстатокУчетаЧасовОстатки.Семестр
	|			И Нагрузка.Предмет = ОстатокУчетаЧасовОстатки.Предмет
	|			И Нагрузка.Группа = ОстатокУчетаЧасовОстатки.Группа";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
    рттр = Запрос.Выполнить().Выгрузить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок1 = Макет.ПолучитьОбласть("Заголовок1");
	ОбластьЗаголовок2 = Макет.ПолучитьОбласть("Заголовок2");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строки");
	
	ОбластьИтог1 = Макет.ПолучитьОбласть("Итог1");
	ОбластьИтог2 = Макет.ПолучитьОбласть("Итог2");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	
	ТабДок.Очистить();
	
	ОбластьЗаголовок.Параметры.Пользователь = ПараметрыСеанса.ТекПользователь;
	ОбластьЗаголовок.Параметры.Дата = Лев(ТекущаяДата(),10);
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьЗаголовок1);
	
	ТабДок.Вывести(ОбластьШапка);
	
	ИтогВсего1 = 0;
	ИтогВсего2 = 0;
	ИтогВсего3 = 0;
	
	Итог1 = 0;
	Итог2 = 0;
	Итог3 = 0;
	Пока Выборка.Следующий() Цикл

	Если Выборка.Семестр = 1 Тогда
		
		Итог1 = Итог1 + Выборка.ВсегоЧасов;
		Итог2 = Итог2 + Выборка.ОтработаноЧасов;
		Итог3 = Итог3 + Выборка.Остаток;
		ОбластьСтроки.Параметры.Заполнить(Выборка);
		ОбластьСтроки.Параметры.Остаток = Строка(Окр(?(Выборка.ВсегоЧасов = 0,0,Выборка.Остаток/Выборка.ВсегоЧасов)*100,0)) + " %";
		ТабДок.Вывести(ОбластьСтроки);
	
	КонецЕсли;	
		
	КонецЦикла;
	
	ИтогВсего1 = ИтогВсего1 + Итог1;
	ИтогВсего2 = ИтогВсего2 + Итог2;
	ИтогВсего3 = ИтогВсего3 + Итог3;
	
	ОбластьИтог1.Параметры.Всего1 = Итог1;
	ОбластьИтог1.Параметры.Отработано1 = Итог2;
	ОбластьИтог1.Параметры.Остаток1 = Строка(Окр(?(Итог1 = 0,0,Итог3/Итог1)*100,0)) + " %";
	
	ТабДок.Вывести(ОбластьИтог1);
	
	ТабДок.Вывести(ОбластьЗаголовок2);
	
	ТабДок.Вывести(ОбластьШапка);
	
	Итог1 = 0;
	Итог2 = 0;
	Итог3 = 0; 
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл

	Если Выборка.Семестр = 2 Тогда
		
		Итог1 = Итог1 + Выборка.ВсегоЧасов;
		Итог2 = Итог2 + Выборка.ОтработаноЧасов;
		Итог3 = Итог3 + Выборка.Остаток;
		ОбластьСтроки.Параметры.Заполнить(Выборка);
		ОбластьСтроки.Параметры.Остаток = Строка(Окр(?(Выборка.ВсегоЧасов = 0,0,Выборка.Остаток/Выборка.ВсегоЧасов)*100,0)) + " %";
		ТабДок.Вывести(ОбластьСтроки);
	
	КонецЕсли;	
		
	КонецЦикла;
	
	ИтогВсего1 = ИтогВсего1 + Итог1;
	ИтогВсего2 = ИтогВсего2 + Итог2;
	ИтогВсего3 = ИтогВсего3 + Итог3;
	
	ОбластьИтог2.Параметры.Всего2 = Итог1;
	ОбластьИтог2.Параметры.Отработано2 = Итог2;
	ОбластьИтог2.Параметры.Остаток2 = Строка(Окр(?(Итог1 = 0,0,Итог3/Итог1)*100,0)) + " %";
	
	ТабДок.Вывести(ОбластьИтог2);
	
	ОбластьИтог.Параметры.ВсегоИтог = ИтогВсего1;
	ОбластьИтог.Параметры.ОтработаноИтог = ИтогВсего2;
	ОбластьИтог.Параметры.ОстатокИтог = Строка(Окр(?(ИтогВсего1 = 0,0,ИтогВсего3/ИтогВсего1)*100,0)) + " %";
	
	ТабДок.Вывести(ОбластьИтог);
	
	//}}
КонецПроцедуры
