
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	
	// регистр ОстатокУчетаЧасов Приход
	Движения.ОстатокУчетаЧасов.Записывать = Истина;
	Для Каждого ТекСтрокаНагрузка1 Из Нагрузка1 Цикл
		Движение = Движения.ОстатокУчетаЧасов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Преподаватель = ПараметрыСеанса.ТекПользователь;
		Движение.ПериодУчебы = УчебныйГод.Период;
		Движение.Период = Дата;
		Движение.Предмет = ТекСтрокаНагрузка1.Предмет;
		Движение.Группа = ТекСтрокаНагрузка1.Группа;
		Движение.Семестр = 1;
		Движение.Количество = ТекСтрокаНагрузка1.ВсегоЧасов;
	КонецЦикла;

	// регистр ОстатокУчетаЧасов Приход
	Движения.ОстатокУчетаЧасов.Записывать = Истина;
	Для Каждого ТекСтрокаНагрузка2 Из Нагрузка2 Цикл
		Движение = Движения.ОстатокУчетаЧасов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Преподаватель = ПараметрыСеанса.ТекПользователь;
		Движение.ПериодУчебы = УчебныйГод.Период;
		Движение.Период = Дата;
		Движение.Предмет = ТекСтрокаНагрузка2.Предмет;
		Движение.Группа = ТекСтрокаНагрузка2.Группа;
		Движение.Семестр = 2;
		Движение.Количество = ТекСтрокаНагрузка2.ВсегоЧасов;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Преподаватель = ПараметрыСеанса.ТекПользователь;
КонецПроцедуры

