

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
	РаботаСоСлужебками.СформироватьСлужебкаПосещаемостиОдногоДняНаСервере(ПороговыйПроцентПосещения, Служебка, Подразделение, Подписант, Группа, Дисциплина, Дата, УчитыватьПодгруппу);
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Подразделение = РаботаССеансом.ПолучитьДолжностьТекущегоПользователя();
	Подписант = РаботаССеансом.ПолучитьПодписьТекущегоПользователя();
	ПороговыйПроцентПосещения = 50;
	
	Если Параметры.Свойство("Группа") Тогда
	
		 Группа =  Параметры.Группа;
	
	 КонецЕсли;
	 Если Параметры.Свойство("Дисциплина") Тогда
	
		 Дисциплина =  Параметры.Дисциплина;
	
	 КонецЕсли;
	 Если Параметры.Свойство("Дата") Тогда
	
		 Дата =  Параметры.Дата;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	ПараметрыВыбораДисциплины = Новый Массив;
	Параметр = Новый ПараметрВыбора("Отбор.Преподаватель", РаботаССеансом.ПолучитьТекПользователя()); 
	ПараметрыВыбораДисциплины.Добавить(Параметр);
	Параметр = Новый ПараметрВыбора("Отбор.ПериодУчебы", УчебныйГод.Период);
	ПараметрыВыбораДисциплины.Добавить(Параметр);
	Элементы.Дисциплина.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораДисциплины);
КонецПроцедуры
