
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Преподаватель");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекПользователь; 
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПериодУчебы");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = УчебныйГод.Период;

    УстановитьУсловноеОформление();    
    
    Описание = "выделен - Вы ведущий преподаватель, курсив - имеется второй преподаватель, подчеркнуто - имеются мои подгруппы";

КонецПроцедуры  

&НаСервере
Процедура УстановитьУсловноеОформление()
 
	 ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	 ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	 // Создаем условие отбора
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВедущийПреподаватель"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	////**** Значение для отбора
	ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекПользователь;

	ЭлементОтбора.Использование = Истина;

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НебесноГолубой);
	
//--------------------------------------
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	 ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	 // Создаем условие отбора
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
 	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВторойПреподаватель"); 
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно; 
	ОтборЭлемента.ПравоеЗначение = ПараметрыСеанса.ТекПользователь;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВторойПреподаватель"); 
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено; 
	
	ЭлементОтбора.Использование = Истина;

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина,Истина));
	
	//--------------------------------------
	
	 ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	 ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	 // Создаем условие отбора
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
 	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИнтервалС"); 
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше; 
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВторойПреподаватель"); 
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ПараметрыСеанса.ТекПользователь;
	
	ЭлементОтбора.Использование = Истина;

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,,,Истина));
	
КонецПроцедуры
