// Разделяет ФИО на массив отдельных Ф,И и О
//
// Параметры:
//  ФИО  - Строка - содержит полное ФИО
//
// Возвращаемое значение:
//   Массив[3]   - отдельно разделенные фамилию, имя и отчество
//
Функция РазделитьФИО(ФИО) Экспорт
	
	ФИОМассив = Новый Массив;
	РазделенноеФИО = СтрРазделить(ФИО, " ", Ложь);
	Если РазделенноеФИО.Количество() = 3 Тогда
	
		 ФИОМассив.Добавить(РазделенноеФИО[0]);
		 ФИОМассив.Добавить(РазделенноеФИО[1]);
		 ФИОМассив.Добавить(РазделенноеФИО[2]);
		 
	 ИначеЕсли РазделенноеФИО.Количество() = 2 Тогда
		 
		 ФИОМассив.Добавить(РазделенноеФИО[0]);
		 ФИОМассив.Добавить(РазделенноеФИО[1]);
		 ФИОМассив.Добавить(" ");
		 
	ИначеЕсли РазделенноеФИО.Количество() = 1 Тогда
		 
		 ФИОМассив.Добавить(РазделенноеФИО[0]);
		 ФИОМассив.Добавить(" ");
		 ФИОМассив.Добавить(" ");
		 
	ИначеЕсли РазделенноеФИО.Количество() = 0 Тогда
		 
		 ФИОМассив.Добавить(" ");
		 ФИОМассив.Добавить(" ");
		 ФИОМассив.Добавить(" ");
	КонецЕсли;
		
   Возврат ФИОМассив;
   
КонецФункции // РазделитьФИО() 

// Получает список индивидуальных групп и дисциплин из спр. Индив настройки
//
// Возвращаемое значение:
//   Массив - содержащий структуры (Группа - СправочникСсылка.Группы, Предмет - СправочникСсылка.Предметы)
//
Функция ПолучитьГруппыИДисциплины() Экспорт
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	
	Мас = Новый Массив;
	
	Выборка = Справочники.ИндивидуальныеНастройкиГрупп.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Преподаватель = ПараметрыСеанса.ТекПользователь 
				И Выборка.ПериодУчебы = УчебныйГод.Период
				И Выборка.ВыводитьВСтатистику = Истина
			Тогда
		
			СтруктураВыборки = Новый Структура;
			СтруктураВыборки.Вставить("Группа", Выборка.Группа);
			СтруктураВыборки.Вставить("Предмет", Выборка.Предмет);
			Мас.Добавить(СтруктураВыборки);
		
		КонецЕсли;
		
	
	КонецЦикла;
	
	Возврат Мас;
	
КонецФункции // ПолучитьГруппыИДисциплины()

// Получает сокращенное ФИО, выводимое в служебках
//
// Параметры:
//  Ссылка  - СправочникСсылка.Преподаватели - содержит ссылку на справочник
//
// Возвращаемое значение:
//   Строка   - н-р Иванов И.И.
//
Функция ПолучитьФИОСокращенноеДляПечати(Ссылка) Экспорт

	  Подпись = Ссылка.Фамилия + " "; 
	  
	  Если Ссылка.Имя <> "" Тогда
	  
	  	   Подпись = Подпись + Лев(Ссылка.Имя,1) + "." 
	  
	   КонецЕсли;
	   Если Ссылка.Отчество <> "" Тогда
	  
	  	   Подпись = Подпись + Лев(Ссылка.Отчество,1) + "." 
	  
	   КонецЕсли;
	   
	   Возврат Подпись;
	   
КонецФункции // ПолучитьФИОСокращенноеДляПечати()

// Склоняет пользователя для служебки, н-р Иванова И.И.
//
// Параметры:
//  ФИОСсылка  - СправочникСсылка.Преподаватели - содержит ссылку на справочник
//  Пол  - Строка - отображение пола как в перечислении Перечисление.Пол
//
// Возвращаемое значение:
//   Массив   - Массив, содержащий возможные варианты склонения строки
//
Функция ПросклонятьПользователяДляДокументов(ФИОСсылка, Пол) Экспорт

	 Возврат ПолучитьСклоненияСтроки(ПолучитьФИОСокращенноеДляПечати(ФИОСсылка), "ПЛ=" + Пол, "ПД=Именительный");

 КонецФункции // ПросклонятьПользователяДляДокументов()

 // Склоняет пользователя для служебки, н-р Иванова И.И.
//
// Параметры:
//  ФИО  - Строка - содержит полное ФИО
//  Пол  - Строка - отображение пола как в перечислении Перечисление.Пол
//
// Возвращаемое значение:
//   Массив   - Массив, содержащий возможные варианты склонения строки
//
 Функция ПросклонятьФИОДляДокументов(ФИО, Пол) Экспорт

	 Возврат ПолучитьСклоненияСтроки(ПолучитьФИОСокращенноеДляПечатиИзСтроки(ФИО), "ПЛ=" + Пол, "ПД=Дательный");

КонецФункции // ПросклонятьФИОДляДокументов()

 // Склоняет студента для служебки, н-р Иванов И.И.
//
// Параметры:
//  ФИО  - Строка - содержит полное ФИО
//
// Возвращаемое значение:
//   Строка   - Массив, содержащий возможные варианты склонения строки
//
Функция ПолучитьФИОСокращенноеДляПечатиИзСтроки(ФИО)
	   
	  ФИОМассив = РазделитьФИО(ФИО);
	  Подпись = ФИОМассив[0] + " ";
	  
	  Если ФИОМассив.Количество() > 1 Тогда
	  
	  	   Подпись = Подпись + Лев(ФИОМассив[1],1) + "." 
	  
	   КонецЕсли;
	   Если ФИОМассив.Количество() > 2 Тогда
	  
	  	   Подпись = Подпись + Лев(ФИОМассив[2],1) + "." 
	  
	   КонецЕсли;
	   
	   Возврат Подпись;
	   
КонецФункции // ПолучитьФИОСокращенноеДляПечати()

 // Получает список всех индив настроек для нагрузки
//
// Параметры:
//  Ссылка  - ДокументСсылка.ФормированиеНагрузки - содержит ссылку на нагрузку
//
// Возвращаемое значение:
//   Массив - Содержит структуры (Предмет - СправочникСсылка.Предметы, Группа - СправочникСсылка.Группы)
//
Функция ПолучитьВсеУникальныеПарыГруппыПредметыИзНагрузки(Ссылка) Экспорт
	
	МассивСтруктурДляНастроек = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФормированиеНагрузкиНагрузка1.Предмет КАК Предмет,
		|	ФормированиеНагрузкиНагрузка1.Группа КАК Группа
		|ПОМЕСТИТЬ Врем
		|ИЗ
		|	Документ.ФормированиеНагрузки.Нагрузка1 КАК ФормированиеНагрузкиНагрузка1
		|ГДЕ
		|	ФормированиеНагрузкиНагрузка1.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФормированиеНагрузкиНагрузка2.Предмет,
		|	ФормированиеНагрузкиНагрузка2.Группа
		|ИЗ
		|	Документ.ФормированиеНагрузки.Нагрузка2 КАК ФормированиеНагрузкиНагрузка2
		|ГДЕ
		|	ФормированиеНагрузкиНагрузка2.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Врем.Предмет КАК Предмет,
		|	Врем.Группа КАК Группа
		|ИЗ
		|	Врем КАК Врем";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураДляНастроек = Новый Структура;
		 СтруктураДляНастроек.Вставить("Предмет",ВыборкаДетальныеЗаписи.Предмет);
		 СтруктураДляНастроек.Вставить("Группа",ВыборкаДетальныеЗаписи.Группа);
	     МассивСтруктурДляНастроек.Добавить(СтруктураДляНастроек);
	КонецЦикла;
	
	Возврат МассивСтруктурДляНастроек;
КонецФункции // ПолучитьВсеУникальныеПарыГруппыПредметыИзНагрузки()

 // Получает сокращенный шифр для предмета
//
// Параметры:
//  Предмет  - СправочникСсылка.Предметы - содержит ссылку на предмет
//
// Возвращаемое значение:
//   Строка   - обозначение шифра, н-р "ИП.01"
//
Функция ПолучитьШифрНаСервере(Предмет) Экспорт

	 Возврат Предмет.Шифр;

КонецФункции // ПолучитьШифрНаСервере()

 // Получает ссылку на куратора и его телефон
//
// Параметры:
//  Группа  - СправочникСсылка.Группы - содержит ссылку на группу
//
// Возвращаемое значение:
//   Массив[2]   - Ссылка на справочник Преподаватели и телефон (строка)
//
Функция ПолучитьДанныеКуратора(Группа) Экспорт

	Мас = Новый Массив;
	Куратор = Справочники.Группы.НайтиПоНаименованию(Группа.Наименование).Куратор;
	Тел = Справочники.Группы.НайтиПоНаименованию(Группа.Наименование).Куратор.Телефон;
    Мас.Добавить(Куратор);
	Мас.Добавить(Тел);
	Возврат Мас;
	
КонецФункции // ПолучитьДанныеКуратора()

 // Получает текстовое название дня недели по дате
//
// Параметры:
//  Дата  - Дата - содержит текущую дату
//
// Возвращаемое значение:
//   Строка   - Название дня недели, н-р "понедельник"
//
Функция ПолучитьНаименованиеДняНедели(Дата) Экспорт
	
	День = "";
	
	Если ДеньНедели(Дата) = 1 Тогда
	
		День = "понедельник";
	
	ИначеЕсли ДеньНедели(Дата) = 2 Тогда
	
		 День = "вторник";
		 
	ИначеЕсли ДеньНедели(Дата) = 3 Тогда
	
		 День = "среда"
		 
	ИначеЕсли ДеньНедели(Дата) = 4 Тогда
	
		 День = "четверг"
		
	ИначеЕсли ДеньНедели(Дата) = 5 Тогда
	
		 День = "пятница"
		
	ИначеЕсли ДеньНедели(Дата) = 6 Тогда
	
		 День = "суббота"
		
	ИначеЕсли ДеньНедели(Дата) = 7 Тогда
	
		 День = "воскресенье"
		
	КонецЕсли;
	
	Возврат День;
	
КонецФункции // ПолучитьНаименованиеДняНедели()

 // Преобразует оценку из числа в текстовую форму
//
// Параметры:
//  Оценка  - Число - содержит оценку от 1 до 5
//
// Возвращаемое значение:
//   Строка   - Название оценки, н-р "Отлично"
//
Функция ПреобразоватьОценкуВТекст(Оценка) Экспорт

	 Если Оценка = 5 Тогда
				
		Возврат "Отлично" 				
		 
	 КонецЕсли;
	Если Оценка = 4 Тогда
				
		Возврат "Хорошо" 				
		 
	КонецЕсли;
	Если Оценка = 3 Тогда
				
		Возврат "Удовлетворительно" 				
		 
	КонецЕсли;
	Если Оценка = 2 Тогда
				
		Возврат "Неудовлетворительно" 				
		 
	 КонецЕсли;

 КонецФункции // ПреобразоватьОценкуВТекст()
 
  // Получает текстовое название месяца по дате
//
// Параметры:
//  Дата  - Дата - содержит текущую дату
//
// Возвращаемое значение:
//   Строка   - Название месяца, н-р "январь"
//
Функция ПолучитьНаименованиеМесяца(Дата) Экспорт
	
	Месяц = "";
	
	Если Месяц(Дата) = 1 Тогда
	
		Месяц = "январь";
	
	ИначеЕсли Месяц(Дата) = 2 Тогда
	
		 Месяц = "февраль";
		 
	ИначеЕсли Месяц(Дата) = 3 Тогда
	
		 Месяц = "март"
		 
	ИначеЕсли Месяц(Дата) = 4 Тогда
	
		 Месяц = "апрель"
		
	ИначеЕсли Месяц(Дата) = 5 Тогда
	
		 Месяц = "май"
		
	ИначеЕсли Месяц(Дата) = 6 Тогда
	
		 Месяц = "июнь"
		
	ИначеЕсли Месяц(Дата) = 7 Тогда
	
		 Месяц = "июль"
		
	 ИначеЕсли Месяц(Дата) = 8 Тогда
	
		 Месяц = "август"
		
	 ИначеЕсли Месяц(Дата) = 9 Тогда
	
		 Месяц = "сентябрь"
		
	 ИначеЕсли Месяц(Дата) = 10 Тогда
	
		 Месяц = "октябрь"
		
	 ИначеЕсли Месяц(Дата) = 11 Тогда
	
		 Месяц = "ноябрь"
		

	 ИначеЕсли Месяц(Дата) = 12 Тогда
	
		 Месяц = "декабрь"
		
	КонецЕсли;
	
	Возврат Месяц;
	
КонецФункции // ПолучитьНаименованиеМесяца()
 
