
 // Формирует служебку посещаемости за один день
//
// Параметры:
//  МинимальныйПорогПосещения - Число - минимальный порог, при посещаемости ниже которого будет формироваться служебка
//  Служебка - ТабличныйДокумент - где формируется служебка
//  Подразделение - Строка - название отдела пользователя
//  Подписант - Строка - текущий пользователь
//  Группа - СправочникСсылка.Группы
//  Дисциплина - СправочникСсылка.Предметы
//  Дата - Дата - дата служебки 
//  УчитыватьПодгруппу - Булево - флаг, отображающий отбор подгруппы
//
Процедура СформироватьСлужебкаПосещаемостиОдногоДняНаСервере(МинимальныйПорогПосещения, 
				Служебка, 
				Подразделение, 
				Подписант, 
				Группа, 
				Дисциплина, 
				Дата, 
				УчитыватьПодгруппу) Экспорт
	
	ПодписантВШапке = РаботаСПечатнымиФормами.ПолучитьПодписантаДляМакетаСлужебкиПосещения();
	Если ПодписантВШапке.Количество() = 0 Тогда
	
		 Сообщить("Задайте подписанта служебной записки!");
		 Возврат;
	
	КонецЕсли;
	
	МакетПосещений = Обработки.ФормированиеСлужебкиПосещение.ПолучитьМакет("МакетСлужебкаПосещаемостьДень"); 
	ТабДок = Служебка;
	
	ТабДок.Очистить();
	
	Если ЗначениеЗаполнено(Дата) И ЗначениеЗаполнено(Группа) И ЗначениеЗаполнено(Дисциплина) Тогда
	
		    //глобальная переменная для отбор всей или части группы
	ВыполнятьОтборПодгруппы = УчитыватьПодгруппу;
	   
		СтатистикаПоСтудентам = РаботаСКонтингентом.ПолучитьСтатистикуПосещенияЗаОдинДень(Дисциплина, Группа, Дата, ВыполнятьОтборПодгруппы);
			
			Для каждого Стр Из СтатистикаПоСтудентам Цикл
 
				
				Если ВыполнятьОтборПодгруппы Тогда
				
					 ВсегоСтудентовВГруппе = РаботаСКонтингентом.ПолучитьКоличествоСтудентовОтобраннойГруппы(Группа, Дисциплина, Дата);
				
				Иначе
				
					 ВсегоСтудентовВГруппе = РаботаСКонтингентом.ПолучитьКоличествоСтудентовГруппы(Группа, Дата);
				
				КонецЕсли;
				
				Прис = ВсегоСтудентовВГруппе - Стр.КоличествоПропусков;
				Проц = Окр(
				?(ВсегоСтудентовВГруппе = 0, 0, Прис*100/ВсегоСтудентовВГруппе),
				0);
				
				Если Проц < МинимальныйПорогПосещения Тогда
				// область формирования макета
					ОбластьШапка = МакетПосещений.ПолучитьОбласть("Шапка");
					ОбластьШапка.Параметры.ЦК = Подразделение;
					ОбластьШапка.Параметры.ФИО = Подписант; 
					ОбластьШапка.Параметры.ДолжностьДолж = ПодписантВШапке[0];
					ОбластьШапка.Параметры.ОргСокр = ПодписантВШапке[1];
					ОбластьШапка.Параметры.ФИОДолж = ПодписантВШапке[2];
					ТабДок.Вывести(ОбластьШапка);
					
					ОбластьНадпись = МакетПосещений.ПолучитьОбласть("Надпись");
					ТабДок.Вывести(ОбластьНадпись);
					
					ОбластьТекст = МакетПосещений.ПолучитьОбласть("Текст");
			
					Если ВыполнятьОтборПодгруппы Тогда
					
						ОбластьТекст.Параметры.Группа = Строка(Группа) + " (одна подгруппа)";
					
					Иначе
					
						 ОбластьТекст.Параметры.Группа = Группа;
					
					КонецЕсли;
					
					ОбластьТекст.Параметры.Предмет = Дисциплина;
					ОбластьТекст.Параметры.Период = Лев(Стр.Дата, 10);
					ОбластьТекст.Параметры.Ном = Стр.НомерПары;
					ОбластьТекст.Параметры.Список = ПолучениеСпискаСтудентовИзМассиваПропускающих(Стр.МассивСтудентовПропускающих);
					ОбластьТекст.Параметры.проц = Проц;
					ТабДок.Вывести(ОбластьТекст);
					
					ОбластьПодпись = МакетПосещений.ПолучитьОбласть("Подпись");
					ОбластьПодпись.Параметры.ТекДата = Лев(Дата,10);
					ТабДок.Вывести(ОбластьПодпись);
					
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
					//--конец области формирования макета
				КонецЕсли;
					
				
		   КонецЦикла;
		   
		

	
	КонецЕсли;
	
	ТабДок.АвтоМасштаб = Истина;

КонецПроцедуры // СформироватьСлужебкаПосещаемостиОдногоДняНаСервере()

 // Получает массив проведенных аттестация по предмету и группе
//
// Параметры:
//  МассивСтудентовПропускающих - Массив - содержит ссылки на студентов
//
// Возвращаемое значение:
//   Строка  - Список студентов, записанный сокращенно
//
Функция ПолучениеСпискаСтудентовИзМассиваПропускающих(МассивСтудентовПропускающих)
	
	ТекстДляВставки = "";
	
	Для н = 0 По МассивСтудентовПропускающих.Количество()-2 Цикл
	
		 ТекстДляВставки = ТекстДляВставки + ОбщиеФункции.ПолучитьФИОСокращенноеДляПечати(МассивСтудентовПропускающих[н]) + ", ";
	
	КонецЦикла;
	
	 ТекстДляВставки = ТекстДляВставки + ОбщиеФункции.ПолучитьФИОСокращенноеДляПечати(МассивСтудентовПропускающих[МассивСтудентовПропускающих.Количество()-1]);
	 
	 Возврат ТекстДляВставки;
 КонецФункции // ПолучениеСпискаСтудентовИзМассиваПропускающих()

  // Формирует служебку посещаемости за один месяц
//
// Параметры:
//  Служебка - ТабличныйДокумент - где формируется служебка
//  Подразделение - Строка - название отдела пользователя
//  Подписант - Строка - текущий пользователь
//  Группа - СправочникСсылка.Группы
//  Дисциплина - СправочникСсылка.Предметы
//  Период - СтандартныйПериод - интервал дат служебки 
//  УчитыватьПодгруппу - Булево - флаг, отображающий отбор подгруппы
//
Процедура СформироватьСлужебкаПосещаемостиОдногоМесяцаПоПредметуНаСервере(Служебка, Подразделение, Подписант, Группа, Дисциплина, Период, УчитыватьПодгруппу) Экспорт
	
	ПодписантВШапке = РаботаСПечатнымиФормами.ПолучитьПодписантаДляМакетаСлужебкиПосещения();
	Если ПодписантВШапке.Количество() = 0 Тогда
	
		 Сообщить("Задайте подписанта служебной записки!");
		 Возврат;
	
	КонецЕсли;
	
	ТЗПропусков = Новый ТаблицаЗначений;
	ТЗПропусков.Колонки.Добавить("Ном");
	ТЗПропусков.Колонки.Добавить("Всего");
	ТЗПропусков.Колонки.Добавить("Прис");
	ТЗПропусков.Колонки.Добавить("Проц");
	
	МакетПосещений = Обработки.ФормированиеСлужебкиПосещение.ПолучитьМакет("МакетСлужебкаПосещаемость"); 
	ТабДок = Служебка;
	
	ТабДок.Очистить();
		
	ОбластьШапка = МакетПосещений.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ЦК = Подразделение;
	ОбластьШапка.Параметры.ФИО = Подписант; 
	ОбластьШапка.Параметры.ДолжностьДолж = ПодписантВШапке[0];
	ОбластьШапка.Параметры.ОргСокр = ПодписантВШапке[1];
	ОбластьШапка.Параметры.ФИОДолж = ПодписантВШапке[2];
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьНадпись = МакетПосещений.ПолучитьОбласть("Надпись");
	ТабДок.Вывести(ОбластьНадпись);
	
	ИтогВсеСтуденты = 0;
	ИтогВсеПрисутствия = 0;
	ИтогПроц = 0;
	Нач = Период.ДатаНачала;
	Кон = Период.ДатаОкончания;
	
	Если ЗначениеЗаполнено(Период) И ЗначениеЗаполнено(Группа) И ЗначениеЗаполнено(Дисциплина) Тогда
	
		    //глобальная переменная для отбор всей или части группы
	ВыполнятьОтборПодгруппы = УчитыватьПодгруппу;
	   
		СтатистикаПоДням = РаботаСКонтингентом.ПолучитьСтатистикуПосещения(Дисциплина, Группа, Нач, Кон, ВыполнятьОтборПодгруппы);
			
			НомерЗанятия = 0;
			
			Для каждого Стр Из СтатистикаПоДням Цикл
				
				НомерЗанятия = НомерЗанятия + 1; 
				
				Если ВыполнятьОтборПодгруппы Тогда
				
					 ВсегоСтудентовВГруппе = РаботаСКонтингентом.ПолучитьКоличествоСтудентовОтобраннойГруппы(Группа, Дисциплина, Кон);
				
				Иначе
				
					 ВсегоСтудентовВГруппе = РаботаСКонтингентом.ПолучитьКоличествоСтудентовГруппы(Группа, Кон);
				
				КонецЕсли;
				
				Строка = ТЗПропусков.Добавить(); 
				Строка.Ном = НомерЗанятия;
				Строка.Всего = ВсегоСтудентовВГруппе;
				Строка.Прис = ВсегоСтудентовВГруппе - Стр.КоличествоПропусков;
				Строка.Проц = Окр(
				?(ВсегоСтудентовВГруппе = 0, 0, (ВсегоСтудентовВГруппе - Стр.КоличествоПропусков)*100/ВсегоСтудентовВГруппе),
				0);
				
			   ИтогВсеСтуденты = ИтогВсеСтуденты + ВсегоСтудентовВГруппе;
			   ИтогВсеПрисутствия = ИтогВсеПрисутствия + (ВсегоСтудентовВГруппе - Стр.КоличествоПропусков);
				
		   КонецЦикла;
		   
		ИтогПроц =  Окр((?(ИтогВсеСтуденты = 0,0,ИтогВсеПрисутствия/ИтогВсеСтуденты))*100,0);
		   
		ОбластьТекст = МакетПосещений.ПолучитьОбласть("Текст");
		
		Если ВыполнятьОтборПодгруппы Тогда
		
			ОбластьТекст.Параметры.Группа = Строка(Группа) + " (одна подгруппа)";
		
		Иначе
		
			 ОбластьТекст.Параметры.Группа = Группа;
		
		КонецЕсли;
		
		ОбластьТекст.Параметры.Предмет = Дисциплина;
		ОбластьТекст.Параметры.Период = ПолучениеПериодаДляСлужебки(Нач, Кон);
		ОбластьТекст.Параметры.Проц = ИтогПроц;
		ТабДок.Вывести(ОбластьТекст);
		
		ОбластьСтрокаСтат = МакетПосещений.ПолучитьОбласть("СтрокаСтат");
		ТабДок.Вывести(ОбластьСтрокаСтат);
		
		Для каждого Стр Из ТЗПропусков Цикл
		
			   ОбластьСтрокаЗнач = МакетПосещений.ПолучитьОбласть("СтрокаЗнач");
				ОбластьСтрокаЗнач.Параметры.Ном = Стр.Ном;
				ОбластьСтрокаЗнач.Параметры.Всего = Стр.Всего; 
				ОбластьСтрокаЗнач.Параметры.Прис = Стр.Прис;
				ОбластьСтрокаЗнач.Параметры.Проц = Стр.Проц;
				ТабДок.Вывести(ОбластьСтрокаЗнач);
		
			КонецЦикла;
			
		ОбластьПодвал = МакетПосещений.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.ВсегоИ = ИтогВсеСтуденты;
		ОбластьПодвал.Параметры.ПрисИ = ИтогВсеПрисутствия; 
		ОбластьПодвал.Параметры.ПроцИ = ИтогПроц;
		ТабДок.Вывести(ОбластьПодвал); 
		
		ОбластьПодпись = МакетПосещений.ПолучитьОбласть("Подпись");
		ОбластьПодпись.Параметры.ТекДата = Лев(ТекущаяДата(),10);
		ТабДок.Вывести(ОбластьПодпись);
		ТабДок.АвтоМасштаб = Истина;
		
	КонецЕсли;
	

КонецПроцедуры // СформироватьСлужебкаПосещаемостиОдногоМесяцаПоПредметуНаСервере()

 // Получает массив проведенных аттестация по предмету и группе
//
// Параметры:
//  Нач - Дата - начальный период
//  Кон - Дата - конечный период
//
// Возвращаемое значение:
//   Строка  - название периода для служебки
//
Функция ПолучениеПериодаДляСлужебки(Нач, Кон)

	Если Кон > ТекущаяДата() Тогда
	
		Кон = ТекущаяДата();
	
	КонецЕсли;
	
	Возврат "с " + Лев(Нач, 10) + " по " + Лев(Кон, 10);

КонецФункции // ПолучениеПериодаДляСлужебки()