
&НаКлиенте
Процедура ПарыВторойПреподавательПриИзменении(Элемент)
	
	ТекДанные = Элементы.Пары.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекДанные.ВторойПреподаватель) Тогда
	
		 ТекДанные.Замена = Ложь;
		 ТекДанные.Совмещение = Ложь;
	
	 КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПарыТарифицированноеПриИзменении(Элемент)
	
	ТекДанные = Элементы.Пары.ТекущиеДанные; 

	 Если ТекДанные.Тарифицированное Тогда
	
		 ТекДанные.Замена = Ложь;
		 ТарифицированоВСистеме = РаботаСКонтингентом.ИмеетсяТарификацияДляГруппыПредмета(ТекДанные.Группа, ТекДанные.Предмет, Объект.Дата);
	     Если Не ТарифицированоВСистеме Тогда
		 
		 	 ТекДанные.Тарифицированное = Ложь;
		 
		 КонецЕсли;
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ПарыЗаменаПриИзменении(Элемент)
	ТекДанные = Элементы.Пары.ТекущиеДанные; 

	 Если ТекДанные.Тарифицированное Тогда
	
		 ТекДанные.Замена = Ложь;
	
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ПарыСовмещениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.Пары.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекДанные.ВторойПреподаватель) Тогда
	
		 ТекДанные.Замена = Ложь;
		 ТекДанные.Совмещение = Ложь;
	
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНовоеВремяЗвонков(Команда)
	ОткрытьФорму("Документ.ФормированиеВремениЗвонков.Форма.ФормаДокумента",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ПарыПредметНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода(); 
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Преподаватель", РаботаССеансом.ПолучитьТекПользователя());
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ПериодУчебы", УчебныйГод.Период);
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элемент.ПараметрыВыбора = НовыеПараметры; 
	
КонецПроцедуры


