

&НаСервере
Процедура ВывестиЖурнал(МассивДат, ОценкиСтуд, Аттестации)
	
	Макет = Обработки.Журнал.ПолучитьМакет("МакетЖурнала");
	ТабДок = СтрЖурнала;
	
	ТабДок.Очистить();
	
	ТабДок.ФиксацияСлева = 2;
	ТабДок.ФиксацияСверху = 1;
	
		
	ОбластьШапкаСтуд = Макет.ПолучитьОбласть("ШапкаСтуд");
	ОбластьДатаОбл = Макет.ПолучитьОбласть("ДатаОбл");
	ОбластьДатаОблЦвет = Макет.ПолучитьОбласть("ДатаОблЦвет");
	
	ОбластьОценкаОбл = Макет.ПолучитьОбласть("ОценкаОбл");
	ОбластьОценкаОблЦвет = Макет.ПолучитьОбласть("ОценкаОблЦвет");
	ОбластьОценкаОблЦветАт = Макет.ПолучитьОбласть("ОценкаОблЦветАт");
	
	ТабДок.Вывести(ОбластьШапкаСтуд); 
	
	// вывод дат 
	
	АттестацияЗаТекущийМесяцВыведена = Ложь; // введена чтобы при наличии раней аттестации, она выводилась в журнале один раз за месяц
	ТекущийМесяц = 0; // "09", "10" - отображает текущий месяц
	
	Для счДат = 1 По МассивДат.Количество() Цикл 
		
		Если Сред(МассивДат[счДат-1].Дата,4,2) <> ТекущийМесяц Тогда
			
				 ТекущийМесяц = Сред(МассивДат[счДат-1].Дата,4,2);
			     АттестацияЗаТекущийМесяцВыведена = Ложь;
				 
		КонецЕсли;
			 
		// Если текущая вносимая дата больше даты аттестации - вывести ячейку
		МассивАттестацииОдногоДня = РаботаСЖурналом.ПолучитьМассивАттестацииОдногоДняЕслиДатаБольшеАттестации(Аттестации, МассивДат[счДат-1].Дата);
		
		 Если МассивАттестацииОдногоДня.Количество() > 0 И НЕ АттестацияЗаТекущийМесяцВыведена Тогда
			 
			 	 ОбластьДатаОблЦвет.Параметры.ДатаЖ = Лев(Строка(НачалоМесяца(МассивДат[счДат-1].Дата)-1),5) + " (А)";
				 ОбластьДатаОблЦвет.Параметры.ДатаЖСсылка = МассивАттестацииОдногоДня[0].Ссылка;
				 ТабДок.Присоединить(ОбластьДатаОблЦвет);
				 ОбластьДатаОблЦвет.Параметры.ДатаЖ = Лев(Строка(НачалоМесяца(МассивДат[счДат-1].Дата)-1),5) + " (И)";
				 ОбластьДатаОблЦвет.Параметры.ДатаЖСсылка = МассивАттестацииОдногоДня[0].Ссылка;
				 ТабДок.Присоединить(ОбластьДатаОблЦвет);
				 АттестацияЗаТекущийМесяцВыведена = Истина;
			 
		 КонецЕсли;		
		 // -----Если текущая вносимая дата больше даты аттестации - вывести ячейку
		 
			 ОбластьДатаОбл.Параметры.ДатаЖ = Лев(МассивДат[счДат-1].Дата,5);
			 ОбластьДатаОбл.Параметры.СсылкаЖ = МассивДат[счДат-1].СсылкаНаУрок;
			 ТабДок.Присоединить(ОбластьДатаОбл);
			 
		// Если текущая вносимая дата меньше даты аттестации для посл записи - вывести ячейку (если она существует)
		Если счДат = МассивДат.Количество() Тогда
		
			    МассивАттестацииОдногоДня = РаботаСЖурналом.ПолучитьМассивАттестацииОдногоДняЕслиДатаМеньшеАттестации(Аттестации, МассивДат[счДат-1].Дата);
		
				 Если МассивАттестацииОдногоДня.Количество() > 0 Тогда
					 
					 	 ОбластьДатаОблЦвет.Параметры.ДатаЖ = Лев(КонецМесяца(МассивДат[счДат-1].Дата),5) + " (А)"; 
						 ОбластьДатаОблЦвет.Параметры.ДатаЖСсылка = МассивАттестацииОдногоДня[0].Ссылка;
						 ТабДок.Присоединить(ОбластьДатаОблЦвет);
						 ОбластьДатаОблЦвет.Параметры.ДатаЖ = Лев(КонецМесяца(МассивДат[счДат-1].Дата),5) + " (И)"; 
						 ОбластьДатаОблЦвет.Параметры.ДатаЖСсылка = МассивАттестацииОдногоДня[0].Ссылка;
						 ТабДок.Присоединить(ОбластьДатаОблЦвет);
					 
				 КонецЕсли;	
		
			 КонецЕсли;
		// -----Если текущая вносимая дата меньше даты аттестации для посл записи - вывести ячейку (если она существует)
	КонецЦикла;

	
	
	// вывод оценок студентов 
	
	АттестацияЗаТекущийМесяцВыведена = Ложь; // введена чтобы при наличии раней аттестации, она выводилась в журнале один раз за месяц
	ТекущийМесяц = 0; // "09", "10" - отображает текущий месяц
	
	Для счСтуд = 1 По ОценкиСтуд.Количество() Цикл
	
		ОбластьСтрокаСтуд = Макет.ПолучитьОбласть("СтрокаСтуд");
		ОбластьСтрокаСтуд.Параметры.НомСт = счСтуд;
		ОбластьСтрокаСтуд.Параметры.ФИОСтуд = ОценкиСтуд[счСтуд-1][0].Студент;
		ТабДок.Вывести(ОбластьСтрокаСтуд);
		
		Для счДат = 1 По МассивДат.Количество() Цикл
			
			Если Сред(МассивДат[счДат-1].Дата,4,2) <> ТекущийМесяц Тогда
			
				 ТекущийМесяц = Сред(МассивДат[счДат-1].Дата,4,2);
			     АттестацияЗаТекущийМесяцВыведена = Ложь;
				 
			КонецЕсли;
			// Если текущая вносимая дата больше даты аттестации - вывести ячейку
			МассивАттестацииОдногоДня = РаботаСЖурналом.ПолучитьМассивАттестацииОдногоДняЕслиДатаБольшеАттестации(Аттестации, МассивДат[счДат-1].Дата);
			
						    Если МассивАттестацииОдногоДня.Количество() > 0 И НЕ АттестацияЗаТекущийМесяцВыведена Тогда
								
								ОценкаСтудентаАттестацияСтруктурой = РаботаСЖурналом.ПолучитьОценкуВАттестацииОдногоДня(МассивАттестацииОдногоДня, ОценкиСтуд[счСтуд-1][0].Студент);
								ОбластьОценкаОблЦветАт.Параметры.Оценка = ОценкаСтудентаАттестацияСтруктурой.А;
								ТабДок.Присоединить(ОбластьОценкаОблЦветАт);
								ОбластьОценкаОблЦветАт.Параметры.Оценка = ОценкаСтудентаАттестацияСтруктурой.И;
								ТабДок.Присоединить(ОбластьОценкаОблЦветАт);
								
								АттестацияЗаТекущийМесяцВыведена = Истина;
								 
							КонецЕсли; 
			// ----Если текущая вносимая дата больше даты аттестации - вывести ячейку
						
						Если ОценкиСтуд[счСтуд-1][0].Отчислен Тогда

							ОбластьОценкаОбл.Параметры.Оценка = "Х";
							ТабДок.Присоединить(ОбластьОценкаОбл);
						    Продолжить;
							
						КонецЕсли;
					
						Если счСтуд%2 <> 0 Тогда

								ОбластьОценкаОблЦвет.Параметры.Оценка = РаботаСЖурналом.ПолучитьОценкуИзМассиваОценок(ОценкиСтуд[счСтуд-1],Лев(МассивДат[счДат-1].Дата,5),МассивДат[счДат-1].НомерПары);
							 	ТабДок.Присоединить(ОбластьОценкаОблЦвет);
							 
						 Иначе

							 	ОбластьОценкаОбл.Параметры.Оценка = РаботаСЖурналом.ПолучитьОценкуИзМассиваОценок(ОценкиСтуд[счСтуд-1],Лев(МассивДат[счДат-1].Дата,5),МассивДат[счДат-1].НомерПары);
							 	ТабДок.Присоединить(ОбластьОценкаОбл);

							КонецЕсли;
			// Если текущая вносимая дата меньше даты аттестации для посл записи - вывести ячейку (если она существует)				
			Если счДат = МассивДат.Количество() Тогда
		
			    МассивАттестацииОдногоДня = РаботаСЖурналом.ПолучитьМассивАттестацииОдногоДняЕслиДатаМеньшеАттестации(Аттестации, МассивДат[счДат-1].Дата);
		
				 Если МассивАттестацииОдногоДня.Количество() > 0 Тогда
					 
					 ОценкаСтудентаАттестацияСтруктурой = РаботаСЖурналом.ПолучитьОценкуВАттестацииОдногоДня(МассивАттестацииОдногоДня, ОценкиСтуд[счСтуд-1][0].Студент);
					 ОбластьОценкаОблЦветАт.Параметры.Оценка = ОценкаСтудентаАттестацияСтруктурой.А;
					 ТабДок.Присоединить(ОбластьОценкаОблЦветАт);
					 ОбластьОценкаОблЦветАт.Параметры.Оценка = ОценкаСтудентаАттестацияСтруктурой.И;
					 ТабДок.Присоединить(ОбластьОценкаОблЦветАт);
					 
				 КонецЕсли;	
		
			 КонецЕсли;
			 // ----Если текущая вносимая дата меньше даты аттестации для посл записи - вывести ячейку (если она существует)
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
    ТабДок.Защита = Истина;
	
	
КонецПроцедуры


&НаСервере
Процедура ВывестиСписокТем(ТемыЖурнала)
	
	Макет = Обработки.Журнал.ПолучитьМакет("МакетТем");
	ТабДок = СписокТем;
	ТабДок.Очистить();
	
	ТабДок.ФиксацияСверху = 1;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьШапка);

	Для каждого СтруктураТемы Из ТемыЖурнала Цикл

		ОбластьСтрока.Параметры.ДатаЗ = Лев(СтруктураТемы.Период,5);
		Если Не СтруктураТемы.Замена Тогда
		
			ОбластьСтрока.Параметры.Колво = СтруктураТемы.КолвоЧасов;
		
		Иначе
		
			ОбластьСтрока.Параметры.Колво = Строка(СтруктураТемы.КолвоЧасов) + Символы.ВК + Символы.ПС + " Замена";
		
		КонецЕсли;
		
		ОбластьСтрока.Параметры.Тема = СтруктураТемы.Тема; 
		ОбластьСтрока.Параметры.Дз = СтруктураТемы.Дз;
		
		ОбластьСтрока.Параметры.Подпись = "";
		
		Если СтруктураТемы.ЗаменяющийПреподаватель <> "" Тогда
		
			ОбластьСтрока.Параметры.Подпись = СтруктураТемы.ЗаменяющийПреподаватель;
			ОбластьСтрока.Параметры.Колво = Строка(СтруктураТемы.КолвоЧасов) + Символы.ВК + Символы.ПС + " Замена";
		
		КонецЕсли;
		
	    ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;	 
	
КонецПроцедуры




&НаКлиенте
Процедура СформироватьЖурнал(Команда)
	Если УчитыватьПереход Тогда
		
		ВыбЭлемент = Элементы.ДоступныеИнтервалыЛет.СписокВыбора.ВыбратьЭлемент("Укажите период формирования");
		Если НЕ ВыбЭлемент = Неопределено Тогда
			Интервал = ВыбЭлемент.Значение;
		КонецЕсли;
	Иначе
		
		Интервал = Дата("00010101");
		
	КонецЕсли;
	
	
	
	ФормированиеЖурналаПоКлику();	
	
КонецПроцедуры 


&НаКлиенте
Процедура ПолучитьСостояниеПрогрессаПоЖурналу(ТекущееСостояние)

	Состояние("Идет формирование журнала...",ТекущееСостояние,,БиблиотекаКартинок.Обработка);

КонецПроцедуры


&НаКлиенте
Процедура ФормированиеЖурналаПоКлику() Экспорт
	
	ПолучитьСостояниеПрогрессаПоЖурналу(0);
	МассивДат = РаботаСЖурналом.СформироватьДатыЖурналаНаСервере(Объект.Предмет, Объект.Группа, Интервал);
	ОценкиСтуд = РаботаСЖурналом.ПолучитьОценкиСтудентовНаСервере(Объект.Предмет, Объект.Группа, Интервал);
	ПолучитьСостояниеПрогрессаПоЖурналу(5);
	ТемыЖурнала = РаботаСЖурналом.ПолучитьСписокТемДляЖурналаНаСервере(Объект.Предмет, Объект.Группа, Интервал);
	Аттестации = РаботаСЖурналом.ПолучитьАттестацииНаСервере(Объект.Группа, Объект.Предмет, Интервал); 
	ПолучитьСостояниеПрогрессаПоЖурналу(10);
	ВывестиЖурнал(МассивДат, ОценкиСтуд, Аттестации);
	ПолучитьСостояниеПрогрессаПоЖурналу(80);
	ВывестиСписокТем(ТемыЖурнала);
    ПолучитьСостояниеПрогрессаПоЖурналу(100);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрЖурналаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Расшифровка);  
	
КонецПроцедуры

&НаКлиенте
Процедура СтрЖурналаВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Область.Верх > 1 Тогда
	
		НомерСтроки = Область.Верх;
		НомерСтолбца = Область.Лево;
	    Если ПредыдущийНомерСтроки <> Неопределено И НомерСтроки <> ПредыдущийНомерСтроки Тогда
	        СтрЖурнала.Область(ПредыдущийНомерСтроки,,ПредыдущийНомерСтроки).ЦветФона = Новый Цвет;        
		КонецЕсли; 
		Если ПредыдущийНомерСтолбца <> Неопределено И НомерСтолбца <> ПредыдущийНомерСтолбца Тогда
	        СтрЖурнала.Область(,ПредыдущийНомерСтолбца,ПредыдущийНомерСтроки).ЦветФона = Новый Цвет;        
	    КонецЕсли;
	    СтрЖурнала.Область(НомерСтроки,,НомерСтроки).ЦветФона = WebЦвета.Аквамарин;
		СтрЖурнала.Область(,НомерСтолбца,НомерСтроки).ЦветФона = WebЦвета.Аквамарин;
	    ПредыдущийНомерСтроки = НомерСтроки;
		ПредыдущийНомерСтолбца = НомерСтолбца;
	
	КонецЕсли;
    
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчитыватьПереход = Истина;

	Если Параметры.Свойство("Отдельный") Тогда
	
		  Если Параметры.Отдельный Тогда
		  
		  	    Элементы.ДоступныеИнтервалыЛет.Видимость = Ложь;
		        УчитыватьПереход = Ложь;
		  КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если УчитыватьПереход Тогда
		
		МасПериодов = РаботаССеансом.ПолучитьВсеПериодыУчебногоГода();
		Элементы.ДоступныеИнтервалыЛет.СписокВыбора.Очистить();
		Для каждого пер Из МасПериодов Цикл
		
			  Элементы.ДоступныеИнтервалыЛет.СписокВыбора.Добавить(пер.Период, пер.Даты);
		
		КонецЦикла;
	
	КонецЕсли;
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	ПараметрыВыбораДисциплины = Новый Массив;
	Параметр = Новый ПараметрВыбора("Отбор.Преподаватель", РаботаССеансом.ПолучитьТекПользователя()); 
	ПараметрыВыбораДисциплины.Добавить(Параметр);
	Параметр = Новый ПараметрВыбора("Отбор.ПериодУчебы", УчебныйГод.Период);
	ПараметрыВыбораДисциплины.Добавить(Параметр);
	Элементы.Предмет.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораДисциплины);
		
КонецПроцедуры



