


&НаКлиенте
Процедура Сформировать(Команда) Экспорт 
	
	РаботаСоСлужебками.СформироватьСлужебкаПосещаемостиОдногоМесяцаПоПредметуНаСервере(Служебка, Подразделение, Подписант, Группа, Дисциплина, Период, УчитыватьПодгруппу);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Подразделение = РаботаССеансом.ПолучитьДолжностьТекущегоПользователя();
	Подписант = РаботаССеансом.ПолучитьПодписьТекущегоПользователя();
	Если Параметры.Свойство("Группа") Тогда
	
		 Группа =  Параметры.Группа;
	
	 КонецЕсли;
	 Если Параметры.Свойство("Дисциплина") Тогда
	
		 Дисциплина =  Параметры.Дисциплина;
	
	 КонецЕсли;
	 Если Параметры.Свойство("Период") Тогда
	
		 Период.ДатаНачала =  НачалоМесяца(Параметры.Период);
		 Период.ДатаОкончания =  КонецМесяца(Параметры.Период);
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	ПараметрыВыбораДисциплины = Новый Массив;
	Параметр = Новый ПараметрВыбора("Отбор.Преподаватель", РаботаССеансом.ПолучитьТекПользователя()); 
	ПараметрыВыбораДисциплины.Добавить(Параметр);
	Параметр = Новый ПараметрВыбора("Отбор.ПериодУчебы", УчебныйГод.Период);
	ПараметрыВыбораДисциплины.Добавить(Параметр);
	Элементы.Дисциплина.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораДисциплины);
КонецПроцедуры
