
Процедура ПередЗаписью(Отказ)
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	
	Преподаватель = ПараметрыСеанса.ТекПользователь;
	ПериодУчебы = УчебныйГод.Период;
	ТекСсылка = Ссылка;
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИндивидуальныеНастройкиГрупп.Предмет КАК Предмет,
		|	ИндивидуальныеНастройкиГрупп.Группа КАК Группа,
		|	ИндивидуальныеНастройкиГрупп.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИндивидуальныеНастройкиГрупп КАК ИндивидуальныеНастройкиГрупп
		|ГДЕ
		|	ИндивидуальныеНастройкиГрупп.ПериодУчебы = &ПериодУчебы
		|	И ИндивидуальныеНастройкиГрупп.Преподаватель = &Преподаватель";
	
	Запрос.УстановитьПараметр("ПериодУчебы", ПериодУчебы);
	Запрос.УстановитьПараметр("Преподаватель", Преподаватель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Предмет = Предмет И ВыборкаДетальныеЗаписи.Группа = Группа Тогда
			
			Если ТекСсылка <> ВыборкаДетальныеЗаписи.Ссылка Тогда
			
				Отказ = Истина;
			
			КонецЕсли;
			 
		
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

