Функция ПолучитьПомеченныеОбъектыНаСервере() Экспорт
	
	ДокУдалМас = Новый Массив;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеЗанятия.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПроведениеЗанятия КАК ПроведениеЗанятия
		|ГДЕ
		|	ПроведениеЗанятия.ПометкаУдаления = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФормированиеДневногоРасписания.Ссылка
		|ИЗ
		|	Документ.ФормированиеДневногоРасписания КАК ФормированиеДневногоРасписания
		|ГДЕ
		|	ФормированиеДневногоРасписания.ПометкаУдаления = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокУдалМас.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	 Возврат ДокУдалМас;
	
КонецФункции