
&НаКлиенте
Процедура Выбрать(Команда)
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("Период",Период);
	СтруктураВыбора.Вставить("Предмет",Предмет);
	ОповеститьОВыборе(СтруктураВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	ПараметрыВыбораДисциплины = Новый Массив;
	Параметр = Новый ПараметрВыбора("Отбор.Преподаватель", РаботаССеансом.ПолучитьТекПользователя()); 
	ПараметрыВыбораДисциплины.Добавить(Параметр);
	Параметр = Новый ПараметрВыбора("Отбор.ПериодУчебы", УчебныйГод.Период);
	ПараметрыВыбораДисциплины.Добавить(Параметр);
	Элементы.Предмет.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораДисциплины);
КонецПроцедуры
