
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.Группы.ПолучитьМакет("МакетСписок");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Студенты.Наименование КАК Наименование,
	|	Студенты.Отчислен КАК Отчислен
	|ИЗ
	|	Справочник.Студенты КАК Студенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Группы КАК Группы
	|		ПО Студенты.Группа = Группы.Ссылка
	|ГДЕ
	|	Студенты.Группа В(&Ссылка)
	|	И Студенты.ПринятВГруппу <= &ДатаЗаявки
	|	И Студенты.УдаленИзГруппы >= &ДатаЗаявки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("ДатаЗаявки", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДок.Очистить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовок.Параметры.Группа = Ссылка[0].Наименование;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтроки = Макет.ПолучитьОбласть("Строки");
	
	
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапка);
	НомерСтроки = 1;
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьСтроки.Параметры.Номер = НомерСтроки;
		
		Если Не Выборка.Отчислен Тогда
		
			 ОбластьСтроки.Параметры.Студент = Выборка.Наименование;
			 
		 Иначе 
			 
			ОбластьСтроки.Параметры.Студент = Выборка.Наименование + " (отчислен)";
			
		КонецЕсли;
		ТабДок.Вывести(ОбластьСтроки);
        НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	//}}
КонецПроцедуры
