

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Пользователь = Справочники.Преподаватели.НайтиПоНаименованию(ПользователиИнформационнойБазы.ТекущийПользователь());
	Если Не Пользователь.Пустая() Тогда
	
		   ПараметрыСеанса.ТекПользователь = Пользователь;
		   Если РольДоступна(Метаданные.Роли.Преподаватель) Тогда
			   
			   ПараметрыСеанса.ТекРоль = Перечисления.Роли.Преподаватель;
			   
		   Иначе
			   
			  ПараметрыСеанса.ТекРоль = Перечисления.Роли.Администратор; 
		   
		   КонецЕсли;		   
		   
	   Иначе
		   
		   Сообщить("Добавьте пользователя в систему!");
		   
	КонецЕсли;
	
КонецПроцедуры
