
&НаСервереБезКонтекста
Процедура ПолучитьСтатистикуНаСервере(Нач, Кон, Статистика, УчитыватьПодгруппы)
	
	ПодвалСтатистика = 0;
	ПодвалЗаписей = 0;
	
	ГруппыДисц = ОбщиеФункции.ПолучитьГруппыИДисциплины();
	
	МакетПосещений = Обработки.СтатистикаПоДисциплинамИГруппам.ПолучитьМакет("МакетПосещаемость"); 
	ТабДок = Статистика;
	
	ТабДок.Очистить();
		
	ОбластьЗаголовок = МакетПосещений.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка = МакетПосещений.ПолучитьОбласть("Шапка");
	ОбластьСтолб1 = МакетПосещений.ПолучитьОбласть("Столб1");
	ОбластьСтолб2 = МакетПосещений.ПолучитьОбласть("Столб2");
	ОбластьСтолб3 = МакетПосещений.ПолучитьОбласть("Столб3");
	ОбластьСтолб4 = МакетПосещений.ПолучитьОбласть("Столб4");
	ОбластьПодвал = МакетПосещений.ПолучитьОбласть("Подвал");
	
	//глобальная переменная для отбор всей или части группы
	ВыполнятьОтборПодгруппы = УчитыватьПодгруппы;
	
	Для каждого набор Из ГруппыДисц Цикл
	
		СтатистикаПоДням = РаботаСКонтингентом.ПолучитьСтатистикуПосещения(набор.Предмет, набор.Группа, Нач, Кон, ВыполнятьОтборПодгруппы);
		
			ОбластьШапка.Параметры.Группа = набор.Группа;
			ОбластьШапка.Параметры.Дисциплина = набор.Предмет;
			ТабДок.Вывести(ОбластьШапка);
			ТабДок.Вывести(ОбластьСтолб1); 
			
			НомерЗанятия = 0;
			ИтогВсеСтуденты = 0;
			ИтогВсеПрисутствия = 0;
			
			Для каждого Стр Из СтатистикаПоДням Цикл
				
				НомерЗанятия = НомерЗанятия + 1; 
				
				Если ВыполнятьОтборПодгруппы Тогда
				
					 ВсегоСтудентовВГруппе = РаботаСКонтингентом.ПолучитьКоличествоСтудентовОтобраннойГруппы(набор.Группа, набор.Предмет, Кон);
				
				Иначе
				
					 ВсегоСтудентовВГруппе = РаботаСКонтингентом.ПолучитьКоличествоСтудентовГруппы(набор.Группа, Кон);
				
				КонецЕсли;
				
			   ОбластьСтолб2.Параметры.ШапкаНЗ = Строка(НомерЗанятия) + " занятие";
			   ОбластьСтолб2.Параметры.Всего = ВсегоСтудентовВГруппе;
			   ОбластьСтолб2.Параметры.Всего1 = ВсегоСтудентовВГруппе - Стр.КоличествоПропусков;
			   
			   ИтогВсеСтуденты = ИтогВсеСтуденты + ВсегоСтудентовВГруппе;
			   ИтогВсеПрисутствия = ИтогВсеПрисутствия + (ВсегоСтудентовВГруппе - Стр.КоличествоПропусков);
			   
			   ТабДок.Присоединить(ОбластьСтолб2);
				
			КонецЦикла;
			
			ОбластьСтолб3.Параметры.ВсегоИтог = ИтогВсеСтуденты;
			ОбластьСтолб3.Параметры.ПрисИтог = ИтогВсеПрисутствия;
			ТабДок.Присоединить(ОбластьСтолб3);
			
			ПосещаемостьСредняяПоПредмету = Окр(?(ИтогВсеСтуденты = 0,0,ИтогВсеПрисутствия/ИтогВсеСтуденты),2);
			ОбластьСтолб4.Параметры.Посещаемость = ПосещаемостьСредняяПоПредмету;
			
			Если ПосещаемостьСредняяПоПредмету > 0 Тогда
			
				ПодвалЗаписей = ПодвалЗаписей + 1;
				ПодвалСтатистика = ПодвалСтатистика + ПосещаемостьСредняяПоПредмету;
			
			КонецЕсли;
			
			ТабДок.Присоединить(ОбластьСтолб4);
			
				
	КонецЦикла;
	ОбластьПодвал.Параметры.Подвал = Окр(?(ПодвалЗаписей = 0,0, ПодвалСтатистика/ПодвалЗаписей), 2);
	ТабДок.Присоединить(ОбластьПодвал);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьУспеваемостьНаСервере(Нач, Кон, СтатистикаУ, УчитыватьПодгруппы)
	
	ПодвалСтатистика = 0;
	ПодвалЗаписей = 0;
	
	ГруппыДисц = ОбщиеФункции.ПолучитьГруппыИДисциплины();
	
	МакетУспеваемости = Обработки.СтатистикаПоДисциплинамИГруппам.ПолучитьМакет("МакетУспеваемость"); 
	ТабДок = СтатистикаУ;
	
	ТабДок.Очистить();
		
	ОбластьЗаголовок = МакетУспеваемости.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(ОбластьЗаголовок); 
	ОбластьПодвал = МакетУспеваемости.ПолучитьОбласть("Подвал");
	
	ОбластьШапка = МакетУспеваемости.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьСтрока = МакетУспеваемости.ПолучитьОбласть("Строка");
	
	//глобальная переменная для отбор всей или части группы
	ВыполнятьОтборПодгруппы = УчитыватьПодгруппы;
	
	Для каждого набор Из ГруппыДисц Цикл
	
		СтатистикаАттест = РаботаСКонтингентом.ПолучитьСтатистикуУспеваемостиНаОснованииАттестации(набор.Предмет, набор.Группа, Нач, Кон, ВыполнятьОтборПодгруппы);
		
			Если ВыполнятьОтборПодгруппы Тогда
				
					 КолвоСтуд = РаботаСКонтингентом.ПолучитьКоличествоСтудентовОтобраннойГруппы(набор.Группа, набор.Предмет, Кон);
				
			Иначе
				
					 КолвоСтуд = РаботаСКонтингентом.ПолучитьКоличествоСтудентовГруппы(набор.Группа, Кон);
				
				КонецЕсли;
				 
			ОбластьСтрока.Параметры.Группа = набор.Группа;
			ОбластьСтрока.Параметры.Предмет = набор.Предмет;
			ОбластьСтрока.Параметры.Контингент = КолвоСтуд;
			ОбластьСтрока.Параметры.Отлично = СтатистикаАттест.КоличествоПятерок;
			ОбластьСтрока.Параметры.Хорошо = СтатистикаАттест.КоличествоЧетверок;
			ОбластьСтрока.Параметры.Удов = СтатистикаАттест.КоличествоТроек;
			ОбластьСтрока.Параметры.Неудов = СтатистикаАттест.КоличествоДвоек;
			ОбластьСтрока.Параметры.Ср = ?(КолвоСтуд = 0,0,
				Окр((СтатистикаАттест.КоличествоПятерок*5+СтатистикаАттест.КоличествоЧетверок*4
				+СтатистикаАттест.КоличествоТроек*3+СтатистикаАттест.КоличествоДвоек*2)/КолвоСтуд,2));
			ОбластьСтрока.Параметры.Абс = ?(КолвоСтуд = 0,0, 
				Окр((СтатистикаАттест.КоличествоПятерок+СтатистикаАттест.КоличествоЧетверок
				+СтатистикаАттест.КоличествоТроек)/КолвоСтуд,2));
				
				Если ОбластьСтрока.Параметры.Абс > 0 Тогда
				
					 ПодвалСтатистика = ПодвалСтатистика +ОбластьСтрока.Параметры.Абс;
				     ПодвалЗаписей = ПодвалЗаписей + 1;
					 
				КонецЕсли;
				 
			ОбластьСтрока.Параметры.Кач = ?(КолвоСтуд = 0,0, 
				Окр((СтатистикаАттест.КоличествоПятерок+СтатистикаАттест.КоличествоЧетверок)/КолвоСтуд,2));
				
				
				ТабДок.Вывести(ОбластьСтрока);	
				
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Подвал = Окр(?(ПодвалЗаписей = 0,0, ПодвалСтатистика/ПодвалЗаписей), 2);
	ТабДок.Присоединить(ОбластьПодвал);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтатистику(Команда)
	
	ПолучитьСтатистикуНаСервере(СтандартныйПериод.ДатаНачала, СтандартныйПериод.ДатаОкончания, Статистика, УчитыватьПодгруппы);
	
	ПолучитьУспеваемостьНаСервере(СтандартныйПериод.ДатаНачала, СтандартныйПериод.ДатаОкончания, СтатистикаУ, УчитыватьПодгруппы);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УчитыватьПодгруппы = Истина;
КонецПроцедуры



&НаКлиенте
Процедура СформироватьСлужебку(Команда)
	ОткрытьФорму("Обработка.ФормированиеСлужебкиПосещение.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СлужебкаЗаДень(Команда)
	ОткрытьФорму("Обработка.ФормированиеСлужебкиПосещение.Форма.ФормаДень");
КонецПроцедуры
