
&НаСервере
Процедура ПоказатьГрафикНаСервере() Экспорт
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Графики.ТипМероприятия КАК ТипМероприятия,
		|	Графики.Начало КАК Начало,
		|	Графики.Окончание КАК Окончание
		|ИЗ
		|	РегистрСведений.Графики КАК Графики
		|ГДЕ
		|	Графики.Группа = &Группа
		|	И Графики.ПериодУчебы = &ПериодУчебы";
	
	Запрос.УстановитьПараметр("Группа", Объект.Группа);
	Запрос.УстановитьПараметр("ПериодУчебы", УчебныйГод.Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	График.Очистить(); 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		 Точка = График.УстановитьТочку(ВыборкаДетальныеЗаписи.ТипМероприятия);
         Точка.Текст = ВыборкаДетальныеЗаписи.ТипМероприятия;
	    Серия = График.УстановитьСерию(Объект.Группа); 
		Серия.Текст = Объект.Группа;
		Значение = График.ПолучитьЗначение(Точка, Серия);
           Интервал = Значение.Добавить();
           Интервал.Начало = ВыборкаДетальныеЗаписи.Начало;
           Интервал.Конец = ВыборкаДетальныеЗаписи.Окончание;
		
		
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьГрафик(Команда)
	ПоказатьГрафикНаСервере();
КонецПроцедуры
