
&НаКлиенте
Процедура ОткрытьГрафикУП(Команда)
	Форма = ОткрытьФорму("Обработка.ГрафикиУчебногоПроцесса.Форма.Форма");
	Форма.Объект.Группа = ПолучитьСсылкуНаГруппу(Объект.Наименование);
	Форма.Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаГруппу(Назв)

	Возврат Справочники.Группы.НайтиПоНаименованию(Назв);	

КонецФункции // ПолучитьСсылкуНаГруппу()


&НаКлиенте
Процедура ПолучитьПериод(Результат, ДопПар) Экспорт

	  Период = Результат;
	  
	Анализ = РаботаСАналитикой.ПровестиАналитикуКластеризацииДляГруппы(Период, ПолучениеГруппыПоНаименованию(Объект.Наименование));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Анализ", Анализ);
	ПараметрыФормы.Вставить("Макет", 0);
	ОткрытьФорму("Обработка.АнализДанных.Форма.Форма", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучениеГруппыПоНаименованию(Наим)

	Возврат Справочники.Группы.НайтиПоНаименованию(Наим);	

КонецФункции // ПолучениеСтудентаПоНаименованию()

&НаКлиенте
Процедура ВыполнитьАнализ(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьПериод", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораЛишьПериода",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьАнализДереваРешенийАттестации(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьПериодДерево", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораЛишьПериода",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПериодДерево(Результат, ДопПар) Экспорт

	  Период = Результат;
	  
	Анализ = РаботаСАналитикой.ПровестиАналитикуАттестованностиДляГруппы(Период, ПолучениеГруппыПоНаименованию(Объект.Наименование));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Анализ", Анализ);
	ПараметрыФормы.Вставить("Макет", 0);
	ОткрытьФорму("Обработка.АнализДанных.Форма.Форма", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры


