
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	
	// регистр ДопЗанятия
	Движения.ДопЗанятия.Записывать = Истина;
	Движение = Движения.ДопЗанятия.Добавить();
	Движение.Период = Дата;
	Движение.Преподаватель = Преподаватель;
	Движение.ПериодУчебы = ПериодУчебы;
	Движение.Предмет = Предмет;
	Движение.Студент = Студент;
	Движение.Месяц = МесяцПредставление;
	Движение.Тема = Тема;
	Движение.Оценка = Оценка;
	Движение.СтараяОценка = СтараяОценка;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	Преподаватель = ПараметрыСеанса.ТекПользователь;
	ПериодУчебы = УчебныйГод.Период;
	
КонецПроцедуры
