
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ФормированиеВремениЗвонков
	Движения.ФормированиеВремениЗвонков.Записывать = Истина;
	Для Каждого ТекСтрокаПары Из Пары Цикл
		Движение = Движения.ФормированиеВремениЗвонков.Добавить();
		Движение.Период = Дата;
		Движение.Преподаватель = ПараметрыСеанса.ТекПользователь;
		Движение.НомерПары = ТекСтрокаПары.НомерПары;
		Движение.Время = ТекСтрокаПары.Время;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
