
&НаСервере
Процедура НаименованиеПриИзмененииНаСервере()
	
	ФИО = ОбщиеФункции.РазделитьФИО(Объект.Наименование); 
	Объект.Фамилия = ФИО[0];
	Объект.Имя = ФИО[1];
	Объект.Отчество = ФИО[2];

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПровестиАнализ(Команда)
	
	Анализ = РаботаСАналитикой.ПровестиОбщуюСтатистикуДляСтудента(ПолучениеСтудентаПоНаименованию(Объект.Наименование));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Анализ", Анализ);
	ПараметрыФормы.Вставить("Макет", 0);
	ОткрытьФорму("Обработка.АнализДанных.Форма.Форма", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучениеСтудентаПоНаименованию(Наим)

	Возврат Справочники.Студенты.НайтиПоНаименованию(Наим);	

КонецФункции // ПолучениеСтудентаПоНаименованию()


&НаКлиенте
Процедура ПровестиАнализПропусков(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьПериод", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораПериода",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПериод(Результат, ДопПар) Экспорт

	  Структура = Результат;
	  
	Анализ = РаботаСАналитикой.ПровестиПоискПропусковЗаПериодПоСтуденту(Структура, ПолучениеСтудентаПоНаименованию(Объект.Наименование));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Анализ", Анализ);
	ПараметрыФормы.Вставить("Макет", 1);
	ОткрытьФорму("Обработка.АнализДанных.Форма.Форма", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ПринятВГруппу) Тогда
	
		 Объект.ПринятВГруппу = НачалоМесяца(ТекущаяДата());
	
	 КонецЕсли; 
	 
	 Если Не ЗначениеЗаполнено(Объект.УдаленИзГруппы) Тогда
	
		 Объект.УдаленИзГруппы = Дата(2100,1,1);
	
	КонецЕсли;
	
КонецПроцедуры
