
Процедура ПередЗаписью(Отказ)
	Если ПараметрыСеанса.ТекРоль = Перечисления.Роли.Преподаватель Тогда
		
		 Сообщить("Организацию может изменять лишь администратор!");
		 Отказ = Истина;
	
	КонецЕсли;
	
	Выборка = Справочники.НастройкиОрганизации.Выбрать();
	КолвоОрганизаций = 0;
	Пока Выборка.Следующий() Цикл
	
		КолвоОрганизаций = КолвоОрганизаций + 1;
	
	КонецЦикла; 
	Если КолвоОрганизаций > 0 И Ссылка = Справочники.НастройкиОрганизации.ПустаяСсылка() Тогда
		
		Сообщить("Нельзя создавать более одной организации!");
		 Отказ = Истина;
	
	КонецЕсли;
КонецПроцедуры
