
&НаСервере
Функция ПолучитьПомеченные()

	Возврат Обработки.УдалениеПомеченныхУроков.ПолучитьПомеченныеОбъектыНаСервере();

КонецФункции // ПолучитьПомеченные()


&НаКлиенте
Процедура ПриОткрытии()
	ДокУдалМас = ПолучитьПомеченные();
	
	Занятия.Очистить();
	Для каждого док Из ДокУдалМас Цикл
	
		Стр = Занятия.Добавить();
		Стр.Удалить = Истина;
		Стр.Документ = док;
	
	КонецЦикла;
  Примечание = "Удаление объектов проводить через обработку 'Удаление помеченных объектов'!";
КонецПроцедуры
