
Процедура ОбработкаПроведения(Отказ, Режим)
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    Движения.Занятия.Записывать = Истина;
	// регистр Занятия 
	
	Для каждого запись Из ТекущиеОценки Цикл
		
		Если запись.Оценка <> "" Тогда
			
			Если запись.Оценка = "другая" Тогда
			
				 Продолжить;
			
			КонецЕсли; 
			
			Движение = Движения.Занятия.Добавить(); 
			Движение.Период = ДатаЗанятия;
			Движение.Предмет = Предмет;
			Движение.Студент = запись.Студент;
			Движение.НомерПары = НомерПары;
			Движение.Преподаватель = ПараметрыСеанса.ТекПользователь;
			Движение.ПериодУчебы = УчебныйГод.Период; 
			
			Если запись.Оценка = "нб" Тогда
				
				Движение.ТипБалла = Перечисления.ТипыБаллов.Отсутствие;
				Движение.Балл = 1;
				
			Иначе
				
				Движение.ТипБалла = Перечисления.ТипыБаллов.Оценка;
				Движение.Балл = запись.Оценка;
			
			КонецЕсли;
			
		
		КонецЕсли;
		
	
	КонецЦикла;
	
	//удаление занятия из списка не проведенных
	
	Регистратор = РаботаСКонтингентом.ПолучениеРегистратораРСПроведенияПары(ДатаЗанятия, Предмет, НомерПары, Группа);

	
	НаборЗаписей = РегистрыСведений.Расписание.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(регистратор);
	
	НаборЗаписей.Прочитать();
	
	Для каждого пара Из НаборЗаписей Цикл
	
		Если пара.НомерПары = НомерПары Тогда
		
			НоваяЗапись = пара;
			НоваяЗапись.ЗанятиеПроведено = Истина;
			НоваяЗапись.ЗаменяющийПреподаватель = КтоЗаменял;
			НоваяЗапись.СсылкаНаУрок = Ссылка;
			
			СеместрТек = 0;
			
			Если НоваяЗапись.Тарифицированное Тогда
			
				// регистр ОстатокУчетаЧасов Расход
				Движения.ОстатокУчетаЧасов.Записывать = Истина;
				Движения.ОстатокУчетаЧасов.Очистить();
				Движение = Движения.ОстатокУчетаЧасов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Преподаватель = ПараметрыСеанса.ТекПользователь;
				Движение.ПериодУчебы = УчебныйГод.Период;
				Движение.Предмет = Предмет;
				Движение.Группа = Группа;
				Если Месяц(Движение.Период) >= 1 И Месяц(Движение.Период) <= 7 Тогда
				
					СеместрТек = 2;	
				
				Иначе
				
					СеместрТек = 1;
				
				КонецЕсли;
				
				Движение.Семестр = СеместрТек;
				
				Движение.Количество = КолвоЧасов;
				
				Движения.ОстатокУчетаЧасов.Записать();
				
				Движения.ОстатокУчетаЧасов.БлокироватьДляИзменения = Истина;
				
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	ОстатокУчетаЧасовОстатки.КоличествоОстаток КАК КоличествоОстаток
						|ИЗ
						|	РегистрНакопления.ОстатокУчетаЧасов.Остатки(
						|			&ГраницаМомВрем,
						|			Группа = &Группа
						|				И Предмет = &Предмет
						|				И Семестр = &Семестр
						|				И Преподаватель = &Преподаватель
						|				И ПериодУчебы = &ПериодУчебы) КАК ОстатокУчетаЧасовОстатки
						|ГДЕ
						|	ОстатокУчетаЧасовОстатки.КоличествоОстаток < 0";
					
					Запрос.УстановитьПараметр("ГраницаМомВрем", Новый Граница(МоментВремени()));
					Запрос.УстановитьПараметр("Группа", Группа);
					Запрос.УстановитьПараметр("Предмет", Предмет);
					Запрос.УстановитьПараметр("Семестр", СеместрТек);
					Запрос.УстановитьПараметр("Преподаватель", ПараметрыСеанса.ТекПользователь);
					Запрос.УстановитьПараметр("ПериодУчебы", УчебныйГод.Период);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Сообщить("Переработка на " + -ВыборкаДетальныеЗаписи.КоличествоОстаток + " часов");
						Отказ = Истина;
					КонецЦикла;


			
			КонецЕсли;
			
		
		КонецЕсли;
	
	КонецЦикла;
	НаборЗаписей.Записать();	
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры




Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЗначениеЗаполнено(РесурсНаМудле) Тогда
	
		ЕстьМатериалы = Истина;
	Иначе
		
		ЕстьМатериалы = Ложь;	
	
	КонецЕсли;
	Если ЗначениеЗаполнено(Комментарий) Тогда
	
		ЕстьКомментарий = Истина;
		
	Иначе
		
		ЕстьКомментарий = Ложь;	
		
	КонецЕсли;
  
	
КонецПроцедуры




Процедура ПриЗаписи(Отказ)
	//добавление ссылки на урок при записи урока на диск
	Если Не Ссылка.Проведен Тогда
	
		  Регистратор = РаботаСКонтингентом.ПолучениеРегистратораРСПроведенияПары(ДатаЗанятия, Предмет, НомерПары, Группа);
	
			НаборЗаписей = РегистрыСведений.Расписание.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(регистратор);
			
			НаборЗаписей.Прочитать();
			
			Для каждого пара Из НаборЗаписей Цикл
			
				Если пара.НомерПары = НомерПары Тогда
				
					НоваяЗапись = пара;
					НоваяЗапись.СсылкаНаУрок = Ссылка; 
					
				КонецЕсли;
			КонецЦикла;
			
			НаборЗаписей.Записать();

	КонецЕсли;
	
	Если Ссылка.ПометкаУдаления Тогда
	
		 Регистратор = РаботаСКонтингентом.ПолучениеРегистратораРСПроведенияПары(ДатаЗанятия, Предмет, НомерПары, Группа); 
	
			НаборЗаписей = РегистрыСведений.Расписание.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
			
			НаборЗаписей.Прочитать();
			
			Для каждого пара Из НаборЗаписей Цикл
			
				Если пара.НомерПары = НомерПары Тогда
				
					НоваяЗапись = пара;
					НоваяЗапись.ЗаменяющийПреподаватель = Справочники.Преподаватели.ПустаяСсылка(); 
					НоваяЗапись.СсылкаНаУрок = Документы.ПроведениеЗанятия.ПустаяСсылка();
					
				КонецЕсли;
			КонецЦикла;
			
			НаборЗаписей.Записать();
	       
		КонецЕсли;
		
КонецПроцедуры


