
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// анализ 1С
	Если Параметры.Макет = 0 Тогда
		ТабДок = Параметры.Анализ;
	КонецЕсли;
	
	//анализ пропусков совместных
    Если Параметры.Макет = 1 Тогда
		
		Макет = Обработки.АнализДанных.ПолучитьМакет("Макет");
		ДанныеАнализа = ПолучитьИзВременногоХранилища(Параметры.Анализ[0]);
		ТабДок.Очистить();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаг = Макет.ПолучитьОбласть("Заг");
		ОбластьСтр = Макет.ПолучитьОбласть("Стр");
		ОбластьСвоиПропуски = Макет.ПолучитьОбласть("СвоиПропуски");
		ОбластьОбъект = Макет.ПолучитьОбласть("Объект");
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьОбъект.Параметры.Студ = Параметры.Анализ[2];
		ТабДок.Вывести(ОбластьОбъект);
		
		ОбластьСвоиПропуски.Параметры.Проп = Параметры.Анализ[1];
		ТабДок.Вывести(ОбластьСвоиПропуски);
		ТабДок.Вывести(ОбластьЗаг);
		НомерСтроки = 0; 
		
		Для каждого Стр Из ДанныеАнализа Цикл
			
			НомерСтроки = НомерСтроки + 1;
			ОбластьСтр.Параметры.Ном = НомерСтроки;
			ОбластьСтр.Параметры.Студент = Стр.Студ;
			ОбластьСтр.Параметры.Колво = Стр.Пропусков;
			ОбластьСтр.Параметры.П = Стр.ПроцПроп;
		    ТабДок.Вывести(ОбластьСтр);
			
		КонецЦикла;

	
	КонецЕсли;
	
КонецПроцедуры
