
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПроведениеАттестации.ПолучитьМакет("МакетАттестация");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроведениеАттестации.Группа КАК Группа,
	|	ЛЕВ(СТРОКА(ПроведениеАттестации.ДатаАттестации), 10) КАК Дата,
	|	ПроведениеАттестации.Предмет КАК Предмет,
	|	ПроведениеАттестации.ОценкиСредние.(
	|		НомерСтроки КАК Номер,
	|		Студент КАК ФИО,
	|		ИтоговаяОценка КАК Оценка,
	|		ИсправленнаяОценка КАК ОценкаНов
	|	) КАК ОценкиСредние,
	|	ПроведениеАттестации.Предмет.БуквенныйКод КАК ПредметШифр
	|ИЗ
	|	Документ.ПроведениеАттестации КАК ПроведениеАттестации
	|ГДЕ
	|	ПроведениеАттестации.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьНазвание = Макет.ПолучитьОбласть("Название");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаб = Макет.ПолучитьОбласть("ШапкаТаб");
	ОбластьСтрокаТаб = Макет.ПолучитьОбласть("СтрокаТаб");
	ОбластьСтрокаТаб2 = Макет.ПолучитьОбласть("СтрокаТаб2");
	ОбластьПодвалТаб = Макет.ПолучитьОбласть("ПодвалТаб");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьНазвание);

		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.Предмет = Строка(Выборка.ПредметШифр) + " " + Строка(Выборка.Предмет);
		
		ТабДок.Вывести(ОбластьЗаголовок, Выборка.Уровень());

		ТабДок.Вывести(ОбластьШапкаТаб);
		
		ВыборкаОценкиСредние = Выборка.ОценкиСредние.Выбрать();
		Пока ВыборкаОценкиСредние.Следующий() Цикл
			
			Если ВыборкаОценкиСредние.Оценка = 2 И ВыборкаОценкиСредние.ОценкаНов < 3 Тогда
			
				ОбластьСтрокаТаб2.Параметры.Заполнить(ВыборкаОценкиСредние);
				ОбластьСтрокаТаб2.Параметры.Оценка = ОбщиеФункции.ПреобразоватьОценкуВТекст(ВыборкаОценкиСредние.Оценка);
				ОбластьСтрокаТаб2.Параметры.ОценкаНов = ОбщиеФункции.ПреобразоватьОценкуВТекст(ВыборкаОценкиСредние.ОценкаНов);
				ТабДок.Вывести(ОбластьСтрокаТаб2, ВыборкаОценкиСредние.Уровень());
			
			Иначе
			
				ОбластьСтрокаТаб.Параметры.Заполнить(ВыборкаОценкиСредние);
				ОбластьСтрокаТаб.Параметры.Оценка = ОбщиеФункции.ПреобразоватьОценкуВТекст(ВыборкаОценкиСредние.Оценка);
				ОбластьСтрокаТаб.Параметры.ОценкаНов = ОбщиеФункции.ПреобразоватьОценкуВТекст(ВыборкаОценкиСредние.ОценкаНов);
				ТабДок.Вывести(ОбластьСтрокаТаб, ВыборкаОценкиСредние.Уровень());
			
			КонецЕсли;
			
			
		КонецЦикла;
		
		ОбластьПодвалТаб.Параметры.Препод = ОбщиеФункции.ПолучитьФИОСокращенноеДляПечати(ПараметрыСеанса.ТекПользователь);
		ТабДок.Вывести(ОбластьПодвалТаб);
		ТабДок.АвтоМасштаб = Истина;
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
