
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	
	// регистр Аттестация 
	Движения.Аттестация.Записывать = Истина;
	Для Каждого ТекСтрокаОценкиСредние Из ОценкиСредние Цикл
		Движение = Движения.Аттестация.Добавить();
		Движение.Период = Дата;
		Движение.Преподаватель = ПараметрыСеанса.ТекПользователь;
		Движение.ПериодУчебы = УчебныйГод.Период;
		Движение.Предмет = Предмет;
		Движение.Студент = ТекСтрокаОценкиСредние.Студент;
		Движение.ТипАттестации = Перечисления.ТипАттестации.Аттестация;
		Движение.Балл = ТекСтрокаОценкиСредние.ИтоговаяОценка;
		
		Если ТекСтрокаОценкиСредние.ИсправленнаяОценка <> 0 Тогда
		
			Движение = Движения.Аттестация.Добавить();
			Движение.Период = Дата;
			Движение.Предмет = Предмет;
			Движение.Преподаватель = ПараметрыСеанса.ТекПользователь;
			Движение.ПериодУчебы = УчебныйГод.Период;
			Движение.Студент = ТекСтрокаОценкиСредние.Студент;
			Движение.ТипАттестации = Перечисления.ТипАттестации.Исправление;
			Движение.Балл = ТекСтрокаОценкиСредние.ИсправленнаяОценка;
		
		КонецЕсли;
	КонецЦикла;
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроведениеЗанятия") Тогда
		// Заполнение шапки
		Группа = ДанныеЗаполнения.Группа;
		Предмет = ДанныеЗаполнения.Предмет;
		ДатаАттестации = ДанныеЗаполнения.ДатаЗанятия;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Дата = КонецМесяца(ДанныеЗаполнения.ДатаЗанятия);
		
		
	
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДатаАттестации) Тогда
	
		 Дата = КонецМесяца(ДатаАттестации);
	
	Иначе
	
		 ДатаАттестации = ТекущаяДата();
		 Дата = КонецМесяца(ДатаАттестации);
	
	 КонецЕсли;
	 
КонецПроцедуры
