
&НаКлиенте
Процедура СуммированиеПоСтрокам(ТекДанные)

	ТекДанные.ВсегоЧасов = ТекДанные.ВсегоЧасовЛек + ТекДанные.ВсегоЧасовЛаб + ТекДанные.ВсегоЧасовКурс + ТекДанные.ВсегоЧасовКонс + ТекДанные.ВсегоЧасовЭкз; 
КонецПроцедуры


&НаКлиенте
Процедура Нагрузка1ВсегоЧасовЛекПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка1.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка1ВсегоЧасовЛабПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка1.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка1ВсегоЧасовКурсПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка1.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка1ВсегоЧасовКонсПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка1.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка1ВсегоЧасовЭкзПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка1.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка2ВсегоЧасовЛекПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка2.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка2ВсегоЧасовЛабПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка2.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура Нагрузка2ВсегоЧасовКурсПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка2.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура Нагрузка2ВсегоЧасовКонсПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка2.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура Нагрузка2ВсегоЧасовЭкзПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка2.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьИндивидуальныеНастройкиНаСервере(Ссылка)
	
	МассивДляДобавления = ОбщиеФункции.ПолучитьВсеУникальныеПарыГруппыПредметыИзНагрузки(Ссылка);
	КолвоДоб = 0;
	КолвоИм = 0;
	
	Для каждого Добавление Из МассивДляДобавления Цикл
		
		Попытка
		
			Запись = Справочники.ИндивидуальныеНастройкиГрупп.СоздатьЭлемент();
		 	Запись.Наименование =  Строка(Добавление.Группа) + " " + Строка(ОбщиеФункции.ПолучитьШифрНаСервере(Добавление.Предмет));
			Запись.Группа = Добавление.Группа;
		 	Запись.Предмет = Добавление.Предмет;
			Запись.ВыводитьВСтатистику = Истина;
		 	Запись.Записать();
		    КолвоДоб = КолвоДоб + 1;
			
		Исключение
		   КолвоИм = КолвоИм + 1;
		КонецПопытки;
		 
	
	КонецЦикла;
	
	Сообщить("Внесено " + КолвоДоб + " настроек, " + КолвоИм + " настроек уже имелось");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИндивидуальныеНастройки(Команда)
	
	Если Модифицированность = Ложь И Объект.Проведен = Истина Тогда
	
		 СформироватьИндивидуальныеНастройкиНаСервере(Объект.Ссылка);
	
	КонецЕсли;
	
	
КонецПроцедуры
