


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Подсказка = "Зеленый - 5; Желтый - 4; Коричневый - 3; Фиолетовый - 2; Зачеркнут - нб; другая - замазывание другой подгруппы";
	
	Если Параметры.Свойство("ВторойПреподаватель") Тогда
        Объект.ВторойПреподаватель = Параметры.ВторойПреподаватель;
    КонецЕсли;
	Если Параметры.Свойство("Предмет") Тогда
        Объект.Предмет = Параметры.Предмет;
		Если Параметры.Свойство("Группа") Тогда
        	Объект.Группа = Параметры.Группа; 
			
			Если Параметры.Свойство("НомерПары") Тогда
		        Объект.НомерПары = Параметры.НомерПары;
				Объект.Дата = Параметры.Период;
				ВыполнитьЗаполнениеИсходнымиДанными(); 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
	

КонецПроцедуры
      
	

&НаСервере
Процедура ВыполнитьЗаполнениеИсходнымиДанными()
	
	Объект.ДатаЗанятия = Объект.Дата;
	
	ДеньНедели = ОбщиеФункции.ПолучитьНаименованиеДняНедели(Объект.ДатаЗанятия) + ")";
	
	ТекТемаИДЗ = РаботаСКонтингентом.ПолучитьНазваниеТемыЧасовСовмещенияИДЗ(Объект.НомерПары,Объект.ДатаЗанятия);
	
	Объект.Тема = ТекТемаИДЗ[0];
    Объект.ДЗ = ТекТемаИДЗ[1];
	Объект.КолвоЧасов = ТекТемаИДЗ[2];
	Объект.ЭтоСовмещение = ТекТемаИДЗ[3];
    Объект.ЭтоЗамена = ТекТемаИДЗ[4];
	Объект.ЭтоАттестация = ТекТемаИДЗ[5];
	
	
	ПоказатьЛейблы(Объект.ЭтоЗамена, Объект.ЭтоСовмещение, Объект.ЭтоАттестация);
	
	Ссылки = РаботаСКонтингентом.ПолучитьСсылкиНаРесурсы(Объект.Предмет, Объект.Группа); 
	Если Ссылки.Количество() > 0 Тогда
		
		Объект.СсылкаНаMoodle = Ссылки[0];
		Объект.СсылкаНаОблако = Ссылки[1];
		
	КонецЕсли;
	
	ВывестиЖурнал(Объект.Группа, Объект.НомерПары);
	
	Если Ссылки.Количество() > 0 Тогда
		Если Ссылки[2] <> 0 И Ссылки[3] <> 0 Тогда
		
			  Для каждого стр Из Объект.ТекущиеОценки Цикл
		
				Если (Ссылки[2]  <= стр.НомерСтроки) И (стр.НомерСтроки <= Ссылки[3]) Тогда
				
					стр.Оценка = "другая";
				
				КонецЕсли;
		
			  КонецЦикла;
		
		КонецЕсли;
	
	КонецЕсли;
	
		
КонецПроцедуры

&НаСервере
Процедура ПоказатьЛейблы(ЭтоЗамена,ЭтоСовмещение, ЭтоАттестация)

	 Элементы.ДекорацияЗамена.Видимость = ЭтоЗамена;
	 Элементы.ДекорацияСовмещение.Видимость = ЭтоСовмещение;
	 Элементы.ДекорацияАттестация.Видимость = ЭтоАттестация;

	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьПредмет(Наим)
   Возврат Справочники.Предметы.НайтиПоНаименованию(Наим);
КонецФункции


&НаСервере
Процедура ВывестиЖурнал(ГруппаПерем, НомерПарыПерем)
	
	СтудентыГруппы = РаботаСКонтингентом.ПолучитьВыборкуСтудентовГруппы(ГруппаПерем, Объект.ДатаЗанятия); 
	
	// заполнение студентами
	Для студ = 0 По СтудентыГруппы[0].Количество()-1 Цикл
	
		Стр = Объект.ТекущиеОценки.Добавить();
		Стр.Студент = СтудентыГруппы[0][студ];
		Стр.Ст = РаботаСКонтингентом.ЯвляетсяСтаростой(СтудентыГруппы[0][студ]);
	    Стр.О = СтудентыГруппы[1][студ];
		
	КонецЦикла;	
	
	
КонецПроцедуры




&НаКлиенте
Процедура ТекущиеОценкиОценкаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ТекущиеОценки.ТекущиеДанные;
	Оценка = ТекСтрока.Оценка;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ДатаЗанятия) Тогда
	
		 ДеньНедели = ОбщиеФункции.ПолучитьНаименованиеДняНедели(Объект.ДатаЗанятия) + ")";
	
	 КонецЕсли;
	 
	 Если ЗначениеЗаполнено(Объект.Группа) Тогда
		 
		 ДанныеКуратора = ОбщиеФункции.ПолучитьДанныеКуратора(Объект.Группа);
		 Куратор = ДанныеКуратора[0];
		 ТелефонКуратора = ДанныеКуратора[1];
	
	 КонецЕсли;

	 
	 Если ЗначениеЗаполнено(Объект.РесурсНаМудле) Тогда
	 
	 	   РесурсНаМудлеПриИзменении();
	 
	   КонецЕсли;
	  Если ЗначениеЗаполнено(Объект.СсылкаНаУдаленное) Тогда
	 
	 	   СсылкаНаMoodleПриИзменении();
	 
	   КонецЕсли;
	   
	   ПоказатьЛейблы(Объект.ЭтоЗамена, Объект.ЭтоСовмещение, Объект.ЭтоАттестация);
	   
	   Если ЗначениеЗаполнено(Объект.Предмет) И ЗначениеЗаполнено(Объект.Группа) Тогда
	 
	 	   Ссылки = РаботаСКонтингентом.ПолучитьСсылкиНаРесурсы(Объект.Предмет, Объект.Группа); 
			Если Ссылки.Количество() > 0 Тогда
			
				Объект.СсылкаНаMoodle = Ссылки[0];
				Объект.СсылкаНаОблако = Ссылки[1];
			
			КонецЕсли;
	 
		КонецЕсли; 
       ВидимостьУдаланнойСсылки();
	   
	   
	
КонецПроцедуры


&НаКлиенте
Процедура УдаленноеЗанятиеПриИзменении(Элемент)
	 ВидимостьУдаланнойСсылки();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьУдаланнойСсылки()

	Если Объект.УдаленноеЗанятие Тогда
	
		 Элементы.СсылкаНаMoodle.Видимость = Истина;
		 
	 Иначе 
		 
		 Элементы.СсылкаНаMoodle.Видимость = Ложь;
		 
	КонецЕсли;

КонецПроцедуры

    
&НаКлиенте
Процедура УбратьПодгруппу(Команда)
	
	Ссылки = РаботаСКонтингентом.ПолучитьСсылкиНаРесурсы(Объект.Предмет, Объект.Группа);
	Если Ссылки.Количество() > 0 Тогда
		Если Ссылки[2] <> 0 И Ссылки[3] <> 0 Тогда
		
			  Сообщить("Подгруппа уже удалена!");
			  			  
		  Иначе
			  
			ВыполнитьУдалениеПодгруппыНаКлиенте();  
			  
		КонецЕсли;
	
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУдалениеПодгруппыНаКлиенте()

	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
    КЧ = Новый КвалификаторыЧисла(2);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КЧ);
	Интервал1 = 0;
	Интервал2 = 0;
	
	Введено1 = ВвестиЗначение(Интервал1,"Начиная с:",ОписаниеТипов);
	Введено2 = ВвестиЗначение(Интервал2,"Заканчивая по:",ОписаниеТипов);
	Если (Введено1 <> Ложь И Введено2 <> Ложь) И (Интервал2 > Интервал1) И Интервал1 <> 0 И Интервал2 <> 0 Тогда
		
		Для каждого стр Из Объект.ТекущиеОценки Цикл
		
			Если (Интервал1  <= стр.НомерСтроки) И (стр.НомерСтроки <= Интервал2) Тогда
			
				стр.Оценка = "другая";
			
			КонецЕсли;
		
		КонецЦикла;
		
		ВыполнитьСохранениеСвоейПодгруппы(Интервал1, Интервал2); 
		Сообщить("Подгруппа сохранена!"); 
		Модифицированность = Истина;
	Иначе
		
		Сообщить("Неверно указаны интервалы!");
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьСохранениеСвоейПодгруппы(Инт1, Инт2)

	Спр = Справочники.ИндивидуальныеНастройкиГрупп.НайтиПоНаименованию(Строка(Объект.Группа) + " " + Строка(Объект.Предмет.Шифр)).ПолучитьОбъект();
    Спр.ИнтервалС = Инт1;
	Спр.ИнтервалПо = Инт2;
	Спр.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЖурналГруппы(Команда)
	
	ПараметрыФормы = Новый Структура("Отдельный", Истина);
	Форма = ПолучитьФорму("Обработка.Журнал.Форма.Форма",ПараметрыФормы);
	Форма.Объект.Предмет = Объект.Предмет;
	Форма.Объект.Группа = Объект.Группа; 
	Форма.ФормированиеЖурналаПоКлику();
	Форма.Открыть();
		
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьГрафикУПГруппы(Команда)
	
	Форма = ПолучитьФорму("Обработка.ГрафикиУчебногоПроцесса.Форма.Форма");
	Форма.Объект.Группа = Объект.Группа;
	Форма.ПоказатьГрафикНаСервере();
	Форма.Открыть();
	
КонецПроцедуры


&НаКлиенте
Процедура РесурсНаМудлеПриИзменении() 
	
	Элементы.РесурсНаМудле.Вид = ВидПоляФормы.ПолеНадписи;
	Элементы.РесурсНаМудле.Гиперссылка = Истина;
	Элементы.УдалитьСсылкуМудл.Видимость = Истина;
	Элементы.РесурсНаМудле.АвтоМаксимальнаяШирина = Истина;
	УстановитьДействиеНажатияРесурс();
КонецПроцедуры

&НаСервере
Процедура УстановитьДействиеНажатияРесурс()

	Элементы.РесурсНаМудле.УстановитьДействие("Нажатие", "ПереходПоСсылкеРесурс");

КонецПроцедуры

&НаСервере
Процедура УстановитьДействиеНажатияУдал()

	Элементы.СсылкаНаMoodle.УстановитьДействие("Нажатие", "ПереходПоСсылкеУдал");

КонецПроцедуры


&НаКлиенте
Процедура СсылкаНаMoodleПриИзменении() 
	
	Элементы.УдалитьСсылкуУдаленное.Видимость = Истина;
	Элементы.СсылкаНаMoodle.Вид = ВидПоляФормы.ПолеНадписи;
	Элементы.СсылкаНаMoodle.Гиперссылка = Истина;
	Элементы.СсылкаНаMoodle.АвтоМаксимальнаяШирина = Истина;
	УстановитьДействиеНажатияУдал(); 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСсылкуМудл(Команда)
	
	Элементы.РесурсНаМудле.Вид = ВидПоляФормы.ПолеВвода;
	Элементы.РесурсНаМудле.АвтоМаксимальнаяШирина = Ложь;
	Объект.РесурсНаМудле = "";
	Элементы.УдалитьСсылкуМудл.Видимость = Ложь; 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСсылкуУдаленное(Команда)
	
	Элементы.СсылкаНаMoodle.Вид = ВидПоляФормы.ПолеВвода;
	Элементы.СсылкаНаMoodle.АвтоМаксимальнаяШирина = Ложь;
	Объект.СсылкаНаУдаленное = "";
	Элементы.УдалитьСсылкуУдаленное.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходПоСсылкеРесурс(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Объект.РесурсНаМудле);
КонецПроцедуры

&НаКлиенте
Процедура ПереходПоСсылкеУдал(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Объект.СсылкаНаУдаленное);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаОблакоНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Объект.СсылкаНаОблако);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаMoodle1Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Объект.СсылкаНаMoodle);
КонецПроцедуры

&НаКлиенте
Процедура ПровестиАттестацию(Команда)
	ОткрытьФорму("Документ.ПроведениеАттестации.Форма.ФормаДокумента");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСлужебкуДня(Команда)
	
	Если НЕ Объект.Проведен Тогда
	
		Сообщить("Документ еще не проведен!");
		Возврат;
	
	КонецЕсли;
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("Группа", Объект.Группа);
	ПараметрыФормы.Вставить("Дисциплина", Объект.Предмет);
	ПараметрыФормы.Вставить("Дата", Объект.ДатаЗанятия);
	Служебка = ПолучитьФорму("Обработка.ФормированиеСлужебкиПосещение.Форма.ФормаДень", ПараметрыФормы);
	Служебка.Сформировать(Команда);
	Служебка.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСлужебкуМесяца(Команда)
	
	Если НЕ Объект.Проведен Тогда
		
		ПоказатьОповещениеПользователя("Предупреждение",
			,"Документ еще не проведен! Данные могут быть неполными!",,СтатусОповещенияПользователя.Информация); 
		
	КонецЕсли;

	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("Группа", Объект.Группа);
	ПараметрыФормы.Вставить("Дисциплина", Объект.Предмет);
	ПараметрыФормы.Вставить("Период", Объект.ДатаЗанятия);
	Служебка = ПолучитьФорму("Обработка.ФормированиеСлужебкиПосещение.Форма.Форма", ПараметрыФормы);
	Служебка.Сформировать(Команда);
	Служебка.Открыть();
	
КонецПроцедуры



