
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	
	// регистр Графики
	Движения.Графики.Записывать = Истина;
	Для Каждого ТекСтрокаГрафики Из Графики Цикл
		Движение = Движения.Графики.Добавить();
		Движение.Группа = Группа;
		Движение.ТипМероприятия = ТекСтрокаГрафики.ТипМероприятия;
		Движение.ПериодУчебы = УчебныйГод.Период;
		Движение.ДатаИсполения = НачалоДня(ТекСтрокаГрафики.Начало);
		Движение.Начало = ТекСтрокаГрафики.Начало;
		Движение.Окончание = ТекСтрокаГрафики.Окончание;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
