// Производит удаление из РС Расписание пометки, что занятие проведено и удаляет ссылку на урок и заменяющего преподавателя
//
Процедура УдалениеИзРегистраСведенийОПроведенииПарыОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Регистратор = РаботаСКонтингентом.ПолучениеРегистратораРСПроведенияПары(Источник.ДатаЗанятия, Источник.Предмет, Источник.НомерПары, Источник.Группа); 
	
	НаборЗаписей = РегистрыСведений.Расписание.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	
	НаборЗаписей.Прочитать();
	
	Для каждого пара Из НаборЗаписей Цикл
	
		Если пара.НомерПары = Источник.НомерПары Тогда
		
			НоваяЗапись = пара;
			НоваяЗапись.ЗанятиеПроведено = Ложь;
			НоваяЗапись.ЗаменяющийПреподаватель = Справочники.Преподаватели.ПустаяСсылка(); 
			НоваяЗапись.СсылкаНаУрок = Документы.ПроведениеЗанятия.ПустаяСсылка();
			
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
КонецПроцедуры

// Производит отображение сообщения о невозможности прохождения аттестации
//
Процедура ЗакрытиеФормыЕслиНеАттестацияОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт 
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ДанныеЗаполнения.ЭтоАттестация Тогда
		
		
	    ВызватьИсключение("Аттестацию проводить нельзя!", КатегорияОшибки.ОтсутствиеРазрешенияДляИспользованияФункциональности);
		
	КонецЕсли;
	
	Если РаботаСКонтингентом.ИмеетсяАттестацияПоДокументуОснованию(ДанныеЗаполнения.Ссылка) Тогда
	
		ВызватьИсключение("Аттестация уже проводилась!", КатегорияОшибки.ОтсутствиеРазрешенияДляИспользованияФункциональности);
	
	КонецЕсли;

	
КонецПроцедуры
