 // Получает список текущих задач (пар) преподавателя
//
// Параметры:
//  ТекущаяДата  - Дата - содержит текущую дату
//
// Возвращаемое значение:
//   Массив   - Содержит структуры ПараСтруктура
//
Функция ПолучитьСписокЗадач(ТекущаяДата) Экспорт
	
	СписокПар = Новый Массив;
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	Если УчебныйГод.Количество() = 0 Тогда
	
		 Возврат СписокПар;
	
	 КонецЕсли;	
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(Расписание.Предмет) КАК ПредметПредставление,
		|	ПРЕДСТАВЛЕНИЕ(Расписание.Группа) КАК ГруппаПредставление,
		|	Расписание.Предмет КАК Предмет,
		|	Расписание.Группа КАК Группа,
		|	Расписание.НомерПары КАК НомерПары,
		|	Расписание.Замена КАК Замена,
		|	Расписание.Совмещение КАК Совмещение,
		|	Расписание.ЗанятиеПроведено КАК ЗанятиеПроведено,
		|	ПРЕДСТАВЛЕНИЕ(Расписание.ВторойПреподаватель) КАК ВторойПреподавательПредставление,
		|	Расписание.ВторойПреподаватель КАК ВторойПреподаватель,
		|	Расписание.СсылкаНаУрок КАК СсылкаНаУрок,
		|	Расписание.Период КАК Период
		|ИЗ
		|	РегистрСведений.Расписание КАК Расписание
		|ГДЕ
		|	Расписание.Период = &Период
		|	И Расписание.ПериодУчебы = &ПериодУчебы
		|	И Расписание.Преподаватель = &Преподаватель
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПары";
	
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата)); 
	Запрос.УстановитьПараметр("ПериодУчебы", УчебныйГод.Период);
	Запрос.УстановитьПараметр("Преподаватель", ПараметрыСеанса.ТекПользователь);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НестандартноеВремя = ПолучитьНестандартноеВремяПоДате(ТекущаяДата);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараСтруктура = Новый Структура;
		ПараСтруктура.Вставить("Период",ВыборкаДетальныеЗаписи.Период);
		ПараСтруктура.Вставить("ПредметП",ВыборкаДетальныеЗаписи.ПредметПредставление);
		ПараСтруктура.Вставить("ГруппаП",ВыборкаДетальныеЗаписи.ГруппаПредставление);
		ПараСтруктура.Вставить("Предмет",ВыборкаДетальныеЗаписи.Предмет);
		ПараСтруктура.Вставить("Группа",ВыборкаДетальныеЗаписи.Группа);
		
		Если НестандартноеВремя.Количество() > 0 Тогда
		
			ПараСтруктура.Вставить("Время",ПолучитьВремяПоНомеруПарыНестандарт(НестандартноеВремя, ВыборкаДетальныеЗаписи.НомерПары));
		
		Иначе
		
			ПараСтруктура.Вставить("Время",ПолучитьВремяПоНомеруПарыСтандарт(ВыборкаДетальныеЗаписи.НомерПары));
		
		КонецЕсли;
		
		ПараСтруктура.Вставить("Замена",ВыборкаДетальныеЗаписи.Замена);
		ПараСтруктура.Вставить("Совмещение",ВыборкаДетальныеЗаписи.Совмещение);
		ПараСтруктура.Вставить("ВторойПреподаватель",ВыборкаДетальныеЗаписи.ВторойПреподаватель);
		ПараСтруктура.Вставить("ВторойПреподавательП",ВыборкаДетальныеЗаписи.ВторойПреподавательПредставление);
		ПараСтруктура.Вставить("ЗанятиеПроведено",ВыборкаДетальныеЗаписи.ЗанятиеПроведено);
		ПараСтруктура.Вставить("Ссылка", ВыборкаДетальныеЗаписи.СсылкаНаУрок);
		ПараСтруктура.Вставить("НомерПары", ВыборкаДетальныеЗаписи.НомерПары);
		СписокПар.Добавить(ПараСтруктура);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Возврат СписокПар;

КонецФункции // ПолучитьСписокЗадач()

// Получает время, сформированное на конкретный день преподавателем
//
// Параметры:
//  Дата  - Дата - содержит текущую дату
//
// Возвращаемое значение:
//   Массив   - Содержит структуры (НомерПары - Число, Время - Строка)
//
Функция ПолучитьНестандартноеВремяПоДате(Дата)
	
	МассивВремени = Новый Массив;
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФормированиеВремениЗвонков.НомерПары КАК НомерПары,
		|	ФормированиеВремениЗвонков.Время КАК Время
		|ИЗ
		|	РегистрСведений.ФормированиеВремениЗвонков КАК ФормированиеВремениЗвонков
		|ГДЕ
		|	ФормированиеВремениЗвонков.Период = &Период
		|	И ФормированиеВремениЗвонков.Преподаватель = &Преподаватель";
	
	Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Преподаватель", ПараметрыСеанса.ТекПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураВремени = Новый Структура;
		СтруктураВремени.Вставить("НомерПары", ВыборкаДетальныеЗаписи.НомерПары);
		СтруктураВремени.Вставить("Время", ВыборкаДетальныеЗаписи.Время);
		МассивВремени.Добавить(СтруктураВремени);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

    Возврат МассивВремени;
	
КонецФункции // ПолучитьНестандартноеВремяПоДате()

// Получает время для пары из структуры сформированного времени
//
// Параметры:
//  Структура  - Структура (НомерПары - Число, Время - Строка)
//  Номер  - Число - содержит текущую дату
//
// Возвращаемое значение:
//   Строка   - Содержит время начала и завершения пары
//
Функция ПолучитьВремяПоНомеруПарыНестандарт(Структура, Номер)

	 Для каждого запись Из Структура Цикл
	 
	 	   Если запись.НомерПары = Номер Тогда
		   
		   	     Возврат запись.Время; 
		   
		   КонецЕсли;
	 
	 КонецЦикла;

КонецФункции // ПолучитьВремяПоНомеруПарыНестандарт()


// Получает стандартное время начала и окончания пары
//
// Параметры:
//  НомерПары  - Число - Содержит номер пары
//
// Возвращаемое значение:
//   Строка   - Содержит время начала и завершения пары
//
Функция ПолучитьВремяПоНомеруПарыСтандарт(НомерПары) Экспорт
	
	Выборка = Справочники.НастройкиОрганизации.Выбрать();
	Пока Выборка.Следующий() Цикл
	
		МассивВремени = Выборка.ВремяЗвонков;
	
	КонецЦикла;
	

	
	 Если НомерПары = 1 Тогда
	 
	 	  Возврат ПоискВремениВМассиве(МассивВремени,НомерПары);
	 
	  КонецЕсли;
	  Если НомерПары = 2 Тогда
	 
	 	  Возврат ПоискВремениВМассиве(МассивВремени,НомерПары);
	 
	  КонецЕсли;
	  Если НомерПары = 3 Тогда
	 
	 	  Возврат ПоискВремениВМассиве(МассивВремени,НомерПары);
	 
	  КонецЕсли;
	  Если НомерПары = 4 Тогда
	 
	 	  Возврат ПоискВремениВМассиве(МассивВремени,НомерПары);
	 
	  КонецЕсли;
	  Если НомерПары = 5 Тогда
	 
	 	  Возврат ПоискВремениВМассиве(МассивВремени,НомерПары);
	 
	 КонецЕсли;
	 
	 Возврат "-";

 КонецФункции // ПолучитьВремяПоНомеруПарыСтандарт()
 
 Функция ПоискВремениВМассиве(Массив, НомерПары)
	 
	Для каждого стр Из Массив Цикл
	
		 Если стр.НомерПары = НомерПары Тогда
		 
		 	  Возврат стр.Время;
		 
		 КонецЕсли;
	
	КонецЦикла; 
	 
 	Возврат "-";
 
 КонецФункции // ПоискВремениВМассиве()
 



