
&НаСервере
Процедура МесяцПриИзмененииНаСервере()
	
	ПропущенныеТемы = РаботаСКонтингентом.ПолучитьСписокПропущенныхТемСтудентомЗаМесяц(Объект.Группа, Объект.Предмет, Число(Объект.Месяц), Объект.Дата,
	                   Объект.Студент);
	
	Элементы.Тема.СписокВыбора.Очистить();
	
	Для каждого СтруктТема Из ПропущенныеТемы Цикл
	
		 Элементы.Тема.СписокВыбора.Добавить(СтруктТема.Тема);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	МесяцПриИзмененииНаСервере();
	Объект.МесяцПредставление = Элементы.Месяц.ТекстРедактирования;
КонецПроцедуры

&НаКлиенте
Процедура ПредметНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода(); 
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Преподаватель", РаботаССеансом.ПолучитьТекПользователя());
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ПериодУчебы", УчебныйГод.Период);
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элемент.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры
