
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	// регистр Расписание
	Движения.Расписание.Записывать = Истина;
	Для Каждого ТекСтрокаПары Из Пары Цикл
		Движение = Движения.Расписание.Добавить();
		Движение.Период = Дата; 
		Движение.Преподаватель = ПараметрыСеанса.ТекПользователь;
		Движение.ПериодУчебы = УчебныйГод.Период;
		Движение.Предмет = ТекСтрокаПары.Предмет;
		Движение.Группа = ТекСтрокаПары.Группа;
		Движение.НомерПары = ТекСтрокаПары.НомерПары;
		Движение.Тема = ТекСтрокаПары.Тема;
		Движение.Дз = ТекСтрокаПары.Дз;
		Движение.Тарифицированное = ТекСтрокаПары.Тарифицированное;
		Движение.Замена = ТекСтрокаПары.Замена;
		Движение.Аттестация = ТекСтрокаПары.Аттестация;
		Движение.Совмещение = ТекСтрокаПары.Совмещение;
		Движение.КолвоЧасов = ТекСтрокаПары.КолвоЧасов;
		Движение.ВторойПреподаватель = ТекСтрокаПары.ВторойПреподаватель;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Расписание.СсылкаНаУрок.Номер, 0) КАК СсылкаНаУрокНомер
		|ИЗ
		|	РегистрСведений.Расписание КАК Расписание
		|ГДЕ
		|	Расписание.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 Если ВыборкаДетальныеЗаписи.СсылкаНаУрокНомер <> 0 Тогда
		 
		 	 ТекДок = Документы.ПроведениеЗанятия.НайтиПоНомеру(ВыборкаДетальныеЗаписи.СсылкаНаУрокНомер).ПолучитьОбъект();
			 ТекДок.УстановитьПометкуУдаления(Истина); 
			 ТекДок.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		 
		 КонецЕсли;
		 
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ОбработкаУдаленияПроведения(Отказ);
КонецПроцедуры
